{"status":"OK","request_id":"06f48b55-7457-4d52-9764-1e226817f8d0","parameters":{"query":"Product Manager","page":1,"num_pages":1,"country":"us","language":"en"},"data":[{"job_id":"9-fAHdhFM0HTEUFYAAAAAA==","job_title":"Sr. Product Manager","employer_name":"Thomson Reuters","employer_logo":null,"employer_website":"https:\/\/www.thomsonreuters.com","job_publisher":"Thomson Reuters Careers","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/careers.thomsonreuters.com\/us\/en\/job\/JREQ195866\/Sr-Product-Manager?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Thomson Reuters Careers","apply_link":"https:\/\/careers.thomsonreuters.com\/us\/en\/job\/JREQ195866\/Sr-Product-Manager?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/sr-product-manager-at-thomson-reuters-4335510097?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Glassdoor","apply_link":"https:\/\/www.glassdoor.com\/job-listing\/sr-product-manager-thomson-reuters-JV_IC1158535_KO0,18_KE19,34.htm?jl=1009935266713&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Built In","apply_link":"https:\/\/builtin.com\/job\/sr-product-manager\/7658359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Notify","apply_link":"https:\/\/notify.careers\/postings\/c9994466-8380-472a-b81d-5d8f71c3a421?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"SimplyHired","apply_link":"https:\/\/www.simplyhired.com\/job\/AE0Nm_i1yMahc1IKqhSKD2ZlHq8U7Yyqn_TelKZfL2PTfTXnZx9GbA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/f8e20f11139af17f5bfca6f148aed83a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Mc Lean - Americanlisted","apply_link":"https:\/\/mclean-va.americanlisted.com\/jobs\/sr-manager-product-manager-consumer-data_8945257576.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Are you passionate about the chance to bring your product management experience to a world class organization that is leading the way in both content and technology to make a safer and more secure world? Do you have the skills necessary to work as a team within Product Management and across the TRSS enterprise to develop innovative solutions, establish product strategies? If you are a team player and have excellent client and project management skills, coupled with the ability to work in complex environments, then Thomson Reuters Special Services (TRSS) is looking for you!\n\nAbout the Role\n\nAs a Senior Product Manager, you will play a key role in guiding and refining the strategic direction of product portfolios. You will develop comprehensive product strategies within the national security cyber operations space that deliver effective, high-value solutions. As a Senior Product Manager, you will contribute to a variety of areas, including:\n\nProduct Strategy and Roadmap\n• Setting the strategy, roadmap, and feature definition for one or more highly visible, strategic products\n• Curating, communicating, and managing a long-term product roadmap\n• Creating product strategies that arrive at solutions that deliver impact by identifying and managing innovative ideas to expand product base and vision\n• Defining key performance indicators (KPIs) and setting targets that move the team toward success\n\nProduct Requirements and Design\n• Providing expert guidance on strategy, design, business requirements, feature and functionality tradeoffs and release schedule for a set of products\n• Specifying and prioritizing market and product requirements, feature sets, and key positioning and messaging elements\n• Proposing and developing use cases for operationalizing cyber operations tools and enhancing capabilities\n\nMarket and User Research\n• Implementing and leveraging insights from UX research, market research, or other analytics to inform product decisions, from the strategic to the tactical\n• Performing competitive analysis and providing recommended strategies to improve product market position\n• Initiating, organizing, conducting, and, managing research tasks or studies from conception to delivery and effectively incorporate results into product strategy\n\nTeam Leadership and Project Management\n• Managing relationships with external partners, vendors, and customers to ensure successful project delivery and product performance\n• Leading the delivery of product and feature enhancements to customers, actively participating in customer planning sessions, and conducting userbase demonstrations\n\nAbout You\n\nYou’re a good fit for the role of Senior Product Manager if you have\/are:\n• Minimum 8 years experience in product management, cyber operations or intelligence operations\n• AI product management experience\n• Comprehensive understanding of intelligence operations, including data collection, analysis, and OSINT research\n• Experience with Software Development Lifecycle and Agile methodologies\n• Experience working on customer requirements and implementing solutions that solve mission critical problems\n• Track record of driving measurable impact in a cross-functional, highly collaborative environment\n• Ability to think big and small to build incremental features and prototypes in service of a larger vision\n• Swift, high-quality decision-making, informed by data, but not inhibited when faced with a lack of it\n• Ability to achieve results with broad performance guidelines and often changing priorities\n• Ability to obtain and maintain a U.S. national security clearance\n• U.S. Citizenship essential to comply with government contract\/agency or department of Federal Government requirements\n\n#LI-CS1\n\nWhat’s in it For You?\n• Hybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected.\n• Flexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\n• Career Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\n• Industry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\n• Culture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast \/ Learn Fast, and Stronger Together.\n• Social Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives.\n• Making a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\n\nIn the United States, Thomson Reuters offers a comprehensive benefits package to our employees. Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match. In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave. These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws. Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan.\n\nThomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position. The base compensation range varies across locations.\nEligible office location(s) for this role include one or more of the following: New York City, San Francisco, Los Angeles, and\/or Irvine, CA; McLean, VA; Washington, DC. The base compensation range for the role in any of those locations is $134,680 - $250,120.\nThis role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance.\nBase pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity. Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs.\n\nAbout Us\n\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\n\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\n\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex\/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\n\nThomson Reuters makes reasonable accommodations for applicants with disabilities, including veterans with disabilities, and for sincerely held religious beliefs in accordance with applicable law. If you reside in the United States and require an accommodation in the recruiting process, you may contact our Human Resources Department at HR.Leave-Expert@thomsonreuters.com. Disability accommodations in the recruiting process may include things like a sign language interpreter, making interview rooms accessible, providing assistive technology, or other relevant accommodations. Please note this email is not intended for general recruitment questions and we will promptly respond to inquiries regarding accommodations. More information on requesting an accommodation here.\n\nLearn more on how to protect yourself from fraudulent job postings here.\n\nMore information about Thomson Reuters can be found on thomsonreuters.com.","job_is_remote":false,"job_posted_at":"21 hours ago","job_posted_at_timestamp":1762815600,"job_posted_at_datetime_utc":"2025-11-10T23:00:00.000Z","job_location":"McLean, VA","job_city":"McLean","job_state":"Virginia","job_country":"US","job_latitude":38.9338676,"job_longitude":-77.1772604,"job_benefits":["health_insurance","paid_time_off","dental_coverage"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D9-fAHdhFM0HTEUFYAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Do you have the skills necessary to work as a team within Product Management and across the TRSS enterprise to develop innovative solutions, establish product strategies?","If you are a team player and have excellent client and project management skills, coupled with the ability to work in complex environments, then Thomson Reuters Special Services (TRSS) is looking for you!","You’re a good fit for the role of Senior Product Manager if you have\/are:","Minimum 8 years experience in product management, cyber operations or intelligence operations","AI product management experience","Comprehensive understanding of intelligence operations, including data collection, analysis, and OSINT research","Experience with Software Development Lifecycle and Agile methodologies","Experience working on customer requirements and implementing solutions that solve mission critical problems","Track record of driving measurable impact in a cross-functional, highly collaborative environment","Ability to think big and small to build incremental features and prototypes in service of a larger vision","Swift, high-quality decision-making, informed by data, but not inhibited when faced with a lack of it","Ability to achieve results with broad performance guidelines and often changing priorities","Ability to obtain and maintain a U.S. national security clearance","U.S. Citizenship essential to comply with government contract\/agency or department of Federal Government requirements"],"Benefits":["Hybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected","Flexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset","This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance","Career Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions","Industry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing","Culture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more","We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives","Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match","In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave","These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws","Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan","Thomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position","The base compensation range varies across locations","The base compensation range for the role in any of those locations is $134,680 - $250,120","This role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance","Base pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity","Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs"],"Responsibilities":["As a Senior Product Manager, you will play a key role in guiding and refining the strategic direction of product portfolios","You will develop comprehensive product strategies within the national security cyber operations space that deliver effective, high-value solutions","As a Senior Product Manager, you will contribute to a variety of areas, including:","Product Strategy and Roadmap","Setting the strategy, roadmap, and feature definition for one or more highly visible, strategic products","Curating, communicating, and managing a long-term product roadmap","Creating product strategies that arrive at solutions that deliver impact by identifying and managing innovative ideas to expand product base and vision","Defining key performance indicators (KPIs) and setting targets that move the team toward success","Product Requirements and Design","Providing expert guidance on strategy, design, business requirements, feature and functionality tradeoffs and release schedule for a set of products","Specifying and prioritizing market and product requirements, feature sets, and key positioning and messaging elements","Proposing and developing use cases for operationalizing cyber operations tools and enhancing capabilities","Market and User Research","Implementing and leveraging insights from UX research, market research, or other analytics to inform product decisions, from the strategic to the tactical","Performing competitive analysis and providing recommended strategies to improve product market position","Initiating, organizing, conducting, and, managing research tasks or studies from conception to delivery and effectively incorporate results into product strategy","Team Leadership and Project Management","Managing relationships with external partners, vendors, and customers to ensure successful project delivery and product performance","Leading the delivery of product and feature enhancements to customers, actively participating in customer planning sessions, and conducting userbase demonstrations"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"FBwUzD8lbeR_sdMdAAAAAA==","job_title":"Principal Product Manager, Ship with Amazon","employer_name":"Amazon.com Services LLC","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcSJpHPsPCtT7v0dsfLzY7WalItl5ZK269S36ESB&s=0","employer_website":"https:\/\/www.amazon.com","job_publisher":"Indeed","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.indeed.com\/viewjob?jk=07e4f505e7a8ee1b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Indeed","apply_link":"https:\/\/www.indeed.com\/viewjob?jk=07e4f505e7a8ee1b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/principal-product-manager-amazon-shipping-at-amazon-4257712484?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"SimplyHired","apply_link":"https:\/\/www.simplyhired.com\/job\/TywI96hcfHK5vTaBjlFfZmAUvjH6mAYAk8lmDNzcA_EsfJCXbHSsig?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JobGet","apply_link":"https:\/\/www.jobget.com\/jobs\/job\/98bf0328-a6dc-442a-856d-c4cab9331e00?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Bandana.com","apply_link":"https:\/\/bandana.com\/jobs\/800b95dc-23a5-4602-9686-71f46d350350?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobs Trabajo.org","apply_link":"https:\/\/us.trabajo.org\/job-3621-57cd93fef69b72a437c14d4103a2bf15?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/principal-manager?id=2203359634&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/eb83429c81ea25e08e65b7f4dbaf4218?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"DESCRIPTION\n\nJoin Amazon Shipping (SWA) to build the next $100B initiative. Shape the future of shipping as a part of a new, emerging business and solve the biggest customer pain points in the small parcel logistics industry globally.\n\nIt’s no secret that Amazon relies on its technology to deliver millions of packages every day to its customers – on time, with low cost. We, the Product and Technology organization, simplify complex software solutions that work across our shippers, vendors, and warehouses to optimize both time & cost of getting the packages delivered. Our services already handle thousands of requests per second, make business decisions impacting billions of dollars a year, integrate with a network of small and large shippers, operators and drivers worldwide, manage business rules for millions of unique products, and improve the ordering and delivery experience for millions of online shoppers. That said, this remains a fast-growing business and our technical journey has only started. Our mission is to build the most efficient and optimal shipping solution on the planet, using our technology and engineering muscle as our biggest advantage. We aim to leverage top technologies in big data and optimization techniques to operate high volume, low latency, and high availability services.\n\nWhat will you do?\nAs Principal Product Manager, you will architect and drive our digital product strategy across web and mobile platforms, creating exceptional user experiences for our customers. In this key leadership role, you will spearhead the vision and roadmap for our digital ecosystem, leveraging customer insights, data analysis, and user research to deliver innovative solutions. You will lead cross-functional teams through complex product development cycles, from conception to launch, ensuring seamless integration across all digital touchpoints.\n\nThe ideal candidate has a strong logistics\/supply chain and digital product management background combined with a solid understanding of current technologies. S\/he can develop and drive high-level strategic initiatives but also roll up their sleeves, dig in and get the job done. Maturity, strong business judgment, ability to influence cross-functional and remote teams, a customer-centric and creative mindset with strong analytical skills are essential. This opportunity requires excellent product management, prioritization, and communication skills, as well as the ability to navigate ambiguity.\n\nKey job responsibilities\n• Define the digital product vision and roadmap.\n• Work directly with customers, stakeholders, UX and engineering to build exceptional products.\n\n- Partner with other teams across Amazon Shipping - Product and Tech to identify and influence development of new products and services.\n• Anticipate bottlenecks, provide escalation management, and make tradeoffs to balance business needs versus technical or operational constraints.\n• Collaborate with global stakeholders in other regions to define requirements that support international use cases.\n• Define user stories and product requirements; contribute to the technical design of new product features.\n• Drive adoption of features, incorporating continuous feedback for improvements based on user experiences.\n• About 10% travel required.\n\nBASIC QUALIFICATIONS\n• Bachelor's degree in Computer Science, Engineering, or a related field\n• 10+ years of success in digital user experience, web\/mobile development or digital product management experience\n• 7+ years of end to end product delivery experience\n• Experience defining roadmap strategy and prioritizing deliverables for your team products\n• Experience managing competing priorities and using metrics to drive business decisions\n• Experience influencing multiple stakeholders and leading cross functional teams across geographies and business units\n\nPREFERRED QUALIFICATIONS\n• MBA, or Master's degree in business, data science, public administration, finance, engineering, human resources or related field\n• Experience in program management, logistics, operations, supply chain, transportation, or equivalent\n• Experience with AI-driven personalization or automation in digital experiences\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https:\/\/amazon.jobs\/content\/en\/how-we-hire\/accommodations for more information. If the country\/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $145,700\/year in our lowest geographic market up to $240,900\/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits. For more information, please visit https:\/\/www.aboutamazon.com\/workplace\/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.","job_is_remote":false,"job_posted_at":"23 hours ago","job_posted_at_timestamp":1762808400,"job_posted_at_datetime_utc":"2025-11-10T21:00:00.000Z","job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DFBwUzD8lbeR_sdMdAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":146000,"job_max_salary":241000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["The ideal candidate has a strong logistics\/supply chain and digital product management background combined with a solid understanding of current technologies","S\/he can develop and drive high-level strategic initiatives but also roll up their sleeves, dig in and get the job done","Maturity, strong business judgment, ability to influence cross-functional and remote teams, a customer-centric and creative mindset with strong analytical skills are essential","This opportunity requires excellent product management, prioritization, and communication skills, as well as the ability to navigate ambiguity","Bachelor's degree in Computer Science, Engineering, or a related field","10+ years of success in digital user experience, web\/mobile development or digital product management experience","7+ years of end to end product delivery experience","Experience defining roadmap strategy and prioritizing deliverables for your team products","Experience managing competing priorities and using metrics to drive business decisions","Experience influencing multiple stakeholders and leading cross functional teams across geographies and business units"],"Benefits":["The base pay for this position ranges from $145,700\/year in our lowest geographic market up to $240,900\/year in our highest geographic market","Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits"],"Responsibilities":["As Principal Product Manager, you will architect and drive our digital product strategy across web and mobile platforms, creating exceptional user experiences for our customers","In this key leadership role, you will spearhead the vision and roadmap for our digital ecosystem, leveraging customer insights, data analysis, and user research to deliver innovative solutions","You will lead cross-functional teams through complex product development cycles, from conception to launch, ensuring seamless integration across all digital touchpoints","Define the digital product vision and roadmap","Work directly with customers, stakeholders, UX and engineering to build exceptional products","Partner with other teams across Amazon Shipping - Product and Tech to identify and influence development of new products and services","Anticipate bottlenecks, provide escalation management, and make tradeoffs to balance business needs versus technical or operational constraints","Collaborate with global stakeholders in other regions to define requirements that support international use cases","Define user stories and product requirements; contribute to the technical design of new product features","Drive adoption of features, incorporating continuous feedback for improvements based on user experiences","About 10% travel required"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"YuXNcGvPcbYvBxnPAAAAAA==","job_title":"Principal Product Manager - Tech, Sponsored Ads","employer_name":"Amazon.com Services LLC","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcSJpHPsPCtT7v0dsfLzY7WalItl5ZK269S36ESB&s=0","employer_website":"https:\/\/www.amazon.com","job_publisher":"Indeed","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.indeed.com\/viewjob?jk=55a9c24e6392f18a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Indeed","apply_link":"https:\/\/www.indeed.com\/viewjob?jk=55a9c24e6392f18a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/principal-product-manager-tech-sponsored-ads-at-amazon-4302097451?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Ladders","apply_link":"https:\/\/www.theladders.com\/job\/principal-product-manager-tech-sponsored-ads-amazon-arlington-va_82793954?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JobGet","apply_link":"https:\/\/www.jobget.com\/jobs\/job\/6670ffb0-1469-4c55-a2c6-11696aff46cc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Bandana.com","apply_link":"https:\/\/bandana.com\/jobs\/9dd361eb-10f9-46b1-94bc-eaa7e2b528d7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"DESCRIPTION\n\nWe're looking for an entrepreneurial product leader who will define and execute all aspects of our advertiser product development and go-to-market strategies for a fast-growing new ad product. Amazon's ad offerings enables customers to discover new products they love while empowering brands to find new customers and grow revenues.\n\nKey job responsibilities\nResponsibilities:\n• Define product needs across ad systems and models that power sponsored ads\n• Surface qualitative and quantitative insights as the voice of the advertisers to shape product direction and ensure product-market fit\n• Scale ad product adoption across advertisers, agencies, and tool providers\n• Collaborate with and leverage the expertise of analytics, legal, PR, sales, and marketing teams to drive product definition and adoption\n\nYour contributions will be highly visible and instrumental in hitting goals carried by Amazon's leadership team (S-Team). A diverse group of stakeholders will rely on your vision and messaging, including advertisers, agencies, and internal ad sales and operations teams.\n\nBASIC QUALIFICATIONS\n• 4+ years of end to end product delivery experience\n• 4+ years of technical product or program management experience\n• Bachelor's degree\n• Experience with feature delivery and tradeoffs of a product\n• Experience owning\/driving roadmap strategy and definition\n• Experience leading engineering discussions around technology decisions and strategy related to a product\n• Experience technical product management\n\nPREFERRED QUALIFICATIONS\n• Experience working directly with Engineers on product enhancements\n• Experience in project management methodologies, business analysis, or process improvement\n• Ad Tech Experience\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https:\/\/amazon.jobs\/content\/en\/how-we-hire\/accommodations for more information. If the country\/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $161,900\/year in our lowest geographic market up to $279,900\/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits. For more information, please visit https:\/\/www.aboutamazon.com\/workplace\/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.","job_is_remote":false,"job_posted_at":"13 hours ago","job_posted_at_timestamp":1762844400,"job_posted_at_datetime_utc":"2025-11-11T07:00:00.000Z","job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DYuXNcGvPcbYvBxnPAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":162000,"job_max_salary":280000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["4+ years of end to end product delivery experience","4+ years of technical product or program management experience","Bachelor's degree","Experience with feature delivery and tradeoffs of a product","Experience owning\/driving roadmap strategy and definition","Experience leading engineering discussions around technology decisions and strategy related to a product","Experience technical product management"],"Benefits":["The base pay for this position ranges from $161,900\/year in our lowest geographic market up to $279,900\/year in our highest geographic market","Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits"],"Responsibilities":["Define product needs across ad systems and models that power sponsored ads","Surface qualitative and quantitative insights as the voice of the advertisers to shape product direction and ensure product-market fit","Scale ad product adoption across advertisers, agencies, and tool providers","Collaborate with and leverage the expertise of analytics, legal, PR, sales, and marketing teams to drive product definition and adoption","Your contributions will be highly visible and instrumental in hitting goals carried by Amazon's leadership team (S-Team)","A diverse group of stakeholders will rely on your vision and messaging, including advertisers, agencies, and internal ad sales and operations teams"]},"job_onet_soc":"11201100","job_onet_job_zone":"4"},{"job_id":"FQLms2zBO9mP0lKmAAAAAA==","job_title":"Product Support\/Project Manager - REMOTE","employer_name":"Tech Pros LLC","employer_logo":null,"employer_website":"https:\/\/www.techprosllc.org","job_publisher":"ZipRecruiter","job_employment_type":"Contractor","job_employment_types":["CONTRACTOR"],"job_apply_link":"https:\/\/www.ziprecruiter.com\/c\/Tech-Pros-LLC\/Job\/Product-Support-Project-Manager-REMOTE\/-in-Washington,DC?jid=2476fd48b18f933e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":true,"apply_options":[{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Tech-Pros-LLC\/Job\/Product-Support-Project-Manager-REMOTE\/-in-Washington,DC?jid=2476fd48b18f933e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"LocalJobs.com","apply_link":"https:\/\/www.localjobs.com\/job\/washington-dc-people-analytics-product-manager-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Today's Jobs","apply_link":"https:\/\/todays-jobs.com\/jobs\/5434224008?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/job\/us-dc-washington-product-manager-remote-kanak-elite-services-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"We are seeking a dynamic and proactive individual to support multiple projects in our IT Governance, Risk and Compliance department. This role involves\nworking closely with department leaders to ensure successful completion of project-related activities, timely filing of project status reports and coordination of problem resolution activities. The successful candidate will be expected to work independently to clear any roadblocks using their organization skills, communication skills and influence to create results. They will work closely with various stakeholders to understand their needs, facilitate smooth transitions, and ensure that new systems are effectively utilized. This position requires a strategic thinker who can drive change and foster a culture of continuous improvement.\nThe ideal candidate will possess excellent communication and project management skills, enabling them to effectively coordinate with cross-functional teams and manage multiple projects simultaneously. While technical subject matter expertise is not required, the candidate should have a strong understanding of GRC principles and the ability to translate technical requirements into actionable plans. They will be expected to create and deliver training programs, develop documentation, and provide ongoing support to ensure the successful adoption of new practices and tools. If you are a motivated leader with a passion for improving IT service delivery, we encourage you to apply.","job_is_remote":false,"job_posted_at":"7 days ago","job_posted_at_timestamp":1762214400,"job_posted_at_datetime_utc":"2025-11-04T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":null,"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DFQLms2zBO9mP0lKmAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":44,"job_max_salary":48,"job_salary_period":"HOUR","job_highlights":{"Qualifications":["This position requires a strategic thinker who can drive change and foster a culture of continuous improvement","The ideal candidate will possess excellent communication and project management skills, enabling them to effectively coordinate with cross-functional teams and manage multiple projects simultaneously","While technical subject matter expertise is not required, the candidate should have a strong understanding of GRC principles and the ability to translate technical requirements into actionable plans"],"Responsibilities":["This role involves","working closely with department leaders to ensure successful completion of project-related activities, timely filing of project status reports and coordination of problem resolution activities","The successful candidate will be expected to work independently to clear any roadblocks using their organization skills, communication skills and influence to create results","They will work closely with various stakeholders to understand their needs, facilitate smooth transitions, and ensure that new systems are effectively utilized","They will be expected to create and deliver training programs, develop documentation, and provide ongoing support to ensure the successful adoption of new practices and tools"]},"job_onet_soc":"13108200","job_onet_job_zone":null},{"job_id":"AHsFAkIppznEhfu8AAAAAA==","job_title":"Product Manager, Manage","employer_name":"BetterUp","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcQqG-eJNE3Q0G-8HjoGLrsFdr7Oe23a-Jcvz8ts&s=0","employer_website":"https:\/\/www.betterup.com","job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/product-manager-manage-at-betterup-4316639533?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/product-manager-manage-at-betterup-4316639533?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobright","apply_link":"https:\/\/jobright.ai\/jobs\/info\/68f69d9d9a65fd34585953f2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JobLeads","apply_link":"https:\/\/www.jobleads.com\/us\/job\/product-manager-manage--arlington--e79aa1a323f2c5964b7113556ebf0f0ae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/274a8553efc1a708d6b09968712ccf42?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Learn4Good","apply_link":"https:\/\/www.learn4good.com\/jobs\/arlington\/virginia\/info_technology\/4549716956\/e\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Let’s face it, a company whose mission is human transformation better have some fresh thinking about the employer\/employee relationship.\n\nWe do. We can’t cram it all in here, but you’ll start noticing it from the first interview.\n\nEven our candidate experience is different. And when you get an offer from us (and accept it), you get way more than a paycheck. You get a personal BetterUp Coach, a development plan, a trained and coached manager, the most amazing team you’ve ever met (yes, each with their own personal BetterUp Coach), and most importantly, work that matters.\n\nThis makes for a remarkably focused and fulfilling work experience. Frankly, it’s not for everyone. But for people with fire in their belly, it’s a game-changing, career-defining, soul-lifting move.\n\nJoin us and we promise you the most intense and fulfilling years of your career, doing life-changing work in a fun, inventive, soulful culture.\n\nIf that sounds exciting—and the job description below feels like a fit—we really should start talking.\n\nBetterUp is seeking a passionate and innovative Product Manager to design and build product experiences that enable human transformation at scale. Our science-backed platform uses an integrated approach, \"braiding\" together human coaching, AI technology, and the science of behavior change to drive individual and organizational transformation.\n\nAs a Product Manager, you will play a pivotal role in shaping our product vision and translating it into an actionable roadmap. Working alongside our app experience product leaders, you'll prioritize features and initiatives based on customer needs, market opportunities, and business impact. You'll collaborate closely with engineering, design, and product pods to ensure timely delivery of high-quality solutions that solve real customer problems. Through continuous feedback from customers and the market, you'll refine the roadmap and ensure the product evolves with changing demands. As the executional backbone of the product team, you'll drive clarity, alignment, and delivery—all while ensuring our solutions address genuine customer problems and deliver measurable business outcomes.\n\nWe are a hybrid company with a focus on in-person collaboration when necessary. Employees are expected to be available to work from one of our office hubs at least two days per week, or eight days per month. Our US hub locations include: Austin, TX; New York City, NY; San Francisco, CA; and the Arlington, VA metro area. Please ensure you can realistically commit to this structure before applying.\n\nWhat You’ll Do\n• Know the Customer: Develop deep understanding of customer needs through research, feedback, and data analysis to inform product decisions and ensure solutions address real user problems.\n• Lead with Courage: Make bold decisions daily and champion innovation to ensure the product continuously evolves to meet changing demands.\n• Drive Product Roadmap Clarity: Translate the product vision into a clear, actionable roadmap for your team. Continuously refine the roadmap based on customer feedback, market insights, and collaboration with app experience product leaders and the go-to-market team.\n• Collaborate Cross-Functionally: Work closely with engineering, design, data, and all application and platform product teams to ensure high-quality solutions that target clear customer outcomes. Foster a culture of learning and innovation by validating solutions and iterating quickly.\n• Craft Impactful User Experiences: Build transformational user experiences that not only meet customer needs but also push the boundaries of what’s possible.\n• Ensure Development Excellence: Serve as the backbone of the product team by driving data-driven clarity and alignment across dependent teams.\n\nIf you have some or all of the following, please apply:\n• Solid experience as a Product Manager or in a product-focused role, with a track record of driving impact. Bonus if you’ve worked on AI\/ML-powered products or platforms.\n• Have contributed to finding product-market fit for at least one consumer-grade product (bonus for consumer apps in health, education, gaming)\n• Self-directed and biased towards action, bringing teammates along with you on your journey, while constantly improving and open to feedback through collaboration\n• A collaborative team player who thrives in an outcome-driven environment and enjoys working with designers and engineers to validate and iterate on potential solutions.\n• Strong decision-making skills and a growth mindset, with a passion for learning and improving processes. Exceptional standards for making data-informed decisions.\n• Experience delivering high-quality, data-driven product experiences and driving clear business outcomes through product innovation.\n• A deep commitment to building impactful solutions that meet customer needs and deliver measurable results.\n• Computer science degree, MBA, and\/or advanced psychology degree is a plus\n\nAI at BetterUp\n\nOur team thrives at the intersection of human expertise and AI capability. As an AI-forward company, adaptation and continuous learning are part of our daily work. We're looking for teammates who are excited to evolve alongside technology – people who experiment boldly, share their discoveries openly, and help define best practices for AI-augmented work. These professionals thoughtfully integrate AI into their work to deliver exceptional results while maintaining the human judgment and creativity that drives real innovation. During our interview process, you’ll have opportunities to showcase how you harness AI to learn, iterate, and amplify your impact.\n\nBenefits\n\nAt BetterUp, we are committed to living out our mission every day and that starts with providing benefits that allow our employees to care for themselves, support their families, and give back to their community.\n• Access to BetterUp coaching; one for you and one for a friend or family member\n• A competitive compensation plan with opportunity for advancement\n• Medical, dental and vision insurance\n• Flexible paid time off\n• Per year:\n• All federal\/statutory holidays observed\n• 4 BetterUp Inner Work days (https:\/\/www.betterup.co\/inner-work)\n• 5 Volunteer Days to give back\n• Learning and Development stipend\n• Company wide Summer & Winter breaks\n• Year-round charitable contribution of your choice on behalf of BetterUp\n• 401(k) self contribution\n\nWe are dedicated to building diverse teams that fuel an authentic workplace and sense of belonging for each and every employee. We know applying for a job can be intimidating, please don’t hesitate to reach out — we encourage everyone interested in joining us to apply.\n\nBetterUp Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, disability, genetics, gender, sexual orientation, age, marital status, veteran status. In addition to federal law requirements, BetterUp Inc. complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\n\nAt BetterUp, we compensate our employees fairly for their work. Base salary is determined by job-related experience, education\/training, residence location, as well as market indicators. The range below is representative of base salary only and does not include equity, sales bonus plans (when applicable) and benefits. This range may be modified in the future.\n\nThe base salary range for this role is $155,550 – $233,300.\n\nWe value your privacy. Your personal data will be processed in accordance with our Privacy Policy. If you have any questions about the privacy of your personal data or your rights with regards to your personal data, please reach out to support@betterup.co","job_is_remote":false,"job_posted_at":"9 hours ago","job_posted_at_timestamp":1762858800,"job_posted_at_datetime_utc":"2025-11-11T11:00:00.000Z","job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":["paid_time_off","dental_coverage","health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DAHsFAkIppznEhfu8AAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":155550,"job_max_salary":233300,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["Solid experience as a Product Manager or in a product-focused role, with a track record of driving impact","Bonus if you’ve worked on AI\/ML-powered products or platforms","Have contributed to finding product-market fit for at least one consumer-grade product (bonus for consumer apps in health, education, gaming)","Self-directed and biased towards action, bringing teammates along with you on your journey, while constantly improving and open to feedback through collaboration","A collaborative team player who thrives in an outcome-driven environment and enjoys working with designers and engineers to validate and iterate on potential solutions","Strong decision-making skills and a growth mindset, with a passion for learning and improving processes","Exceptional standards for making data-informed decisions","Experience delivering high-quality, data-driven product experiences and driving clear business outcomes through product innovation","A deep commitment to building impactful solutions that meet customer needs and deliver measurable results"],"Benefits":["You get a personal BetterUp Coach, a development plan, a trained and coached manager, the most amazing team you’ve ever met (yes, each with their own personal BetterUp Coach), and most importantly, work that matters","At BetterUp, we are committed to living out our mission every day and that starts with providing benefits that allow our employees to care for themselves, support their families, and give back to their community","Access to BetterUp coaching; one for you and one for a friend or family member","A competitive compensation plan with opportunity for advancement","Medical, dental and vision insurance","Flexible paid time off","Per year:","All federal\/statutory holidays observed","4 BetterUp Inner Work days (https:\/\/www.betterup.co\/inner-work)","5 Volunteer Days to give back","Learning and Development stipend","Company wide Summer & Winter breaks","Year-round charitable contribution of your choice on behalf of BetterUp","401(k) self contribution","The range below is representative of base salary only and does not include equity, sales bonus plans (when applicable) and benefits","The base salary range for this role is $155,550 – $233,300"],"Responsibilities":["This makes for a remarkably focused and fulfilling work experience","As a Product Manager, you will play a pivotal role in shaping our product vision and translating it into an actionable roadmap","Working alongside our app experience product leaders, you'll prioritize features and initiatives based on customer needs, market opportunities, and business impact","You'll collaborate closely with engineering, design, and product pods to ensure timely delivery of high-quality solutions that solve real customer problems","Through continuous feedback from customers and the market, you'll refine the roadmap and ensure the product evolves with changing demands","As the executional backbone of the product team, you'll drive clarity, alignment, and delivery—all while ensuring our solutions address genuine customer problems and deliver measurable business outcomes","Know the Customer: Develop deep understanding of customer needs through research, feedback, and data analysis to inform product decisions and ensure solutions address real user problems","Lead with Courage: Make bold decisions daily and champion innovation to ensure the product continuously evolves to meet changing demands","Drive Product Roadmap Clarity: Translate the product vision into a clear, actionable roadmap for your team","Continuously refine the roadmap based on customer feedback, market insights, and collaboration with app experience product leaders and the go-to-market team","Collaborate Cross-Functionally: Work closely with engineering, design, data, and all application and platform product teams to ensure high-quality solutions that target clear customer outcomes","Foster a culture of learning and innovation by validating solutions and iterating quickly","Craft Impactful User Experiences: Build transformational user experiences that not only meet customer needs but also push the boundaries of what’s possible","Ensure Development Excellence: Serve as the backbone of the product team by driving data-driven clarity and alignment across dependent teams"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"4p8pPyPN3sDYEXBnAAAAAA==","job_title":"Product Design Manager","employer_name":"Capital One","employer_logo":null,"employer_website":"https:\/\/www.capitalone.com","job_publisher":"Capital One Careers","job_employment_type":"Full-time and Part-time","job_employment_types":["FULLTIME","PARTTIME"],"job_apply_link":"https:\/\/www.capitalonecareers.com\/job\/mclean\/product-design-manager\/1732\/88283345984?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Capital One Careers","apply_link":"https:\/\/www.capitalonecareers.com\/job\/mclean\/product-design-manager\/1732\/88283345984?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Monster","apply_link":"https:\/\/www.monster.com\/job-openings\/product-design-manager-new-york-ny--770ee442-954a-4bcc-8606-b430c3116143?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Capitalone\/Job\/Product-Design-Manager\/-in-New-York,NY?jid=97d4341694f91277&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"AnitaB.org Job Board","apply_link":"https:\/\/jobs.anitab.org\/companies\/capital-one\/jobs\/58047563-product-design-manager?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Tallo","apply_link":"https:\/\/tallo.com\/jobs\/design\/industrial-designer\/ny\/new-york\/product-design-manager-3\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Glassdoor","apply_link":"https:\/\/www.glassdoor.com\/job-listing\/product-design-manager-clear-JV_IC1132348_KO0,22_KE23,28.htm?jl=1009899747149&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"Built In NYC","apply_link":"https:\/\/www.builtinnyc.com\/job\/product-design-manager\/7320674?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JobzMall","apply_link":"https:\/\/www.jobzmall.com\/pepsico\/job\/product-design-manager-6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true}],"job_description":"Product Design Manager\n\nWe’re currently seeking a Product Designer to join our Experience Design, Core Card Experiences Acquisitions team. We’re passionate about creating memorable, meaningful product experiences that build the Capital One brand with humanity and drive business advantage and innovation.\n\nThe Experience Design team at Capital One is at the forefront of enriching our customers’ digital and physical experiences. We champion a thriving environment of collaboration, authenticity and healthy critique, in which we honor diversity of thought, create a culture of belonging, and elevate one another. If you’re a creative innovator who embraces an environment where you can experiment, learn, and change banking for good, we’d love to hear from you.\n\nRole Expectations\n\nAs a Product Designer, you’ll combine your craft expertise and leadership skills with an understanding of our customers and the business to co-create innovative solutions to complex problems and influence product strategy.\n\nHere are some of the expected competencies for this role:\n\nProduct Design Expertise: Demonstrate a high degree of skill in product design, leveraging a variety of skills across interaction, visual and service design; in collaboration with cross-functional partners, inform the use of appropriate tools, platforms, frameworks and design systems and creates artifacts that may include journey maps, blueprints, high-fidelity designs and prototypes\n\nLeadership: Lead design projects, directing and delegating work for more junior team members and building strong partnerships with cross-functional stakeholders while also mentoring and helping to mature the overall product design practice at Capital One\n\nHuman-Centered: Effectively navigate the needs of partners and stakeholders, leveraging critical-thinking skills that factor in data, research insights, scalability and tech constraints, while ensuring the team focuses on customer-centered solutions and inclusive design\n\nBusiness-Focused: Demonstrate proficiency with products and processes and apply relevant insights on customers, competitors and broader market trends to business challenges that shape a shared point of view for your team, partners and stakeholders\n\nProblem-Solving: Demonstrate a solid understanding of tech, data capabilities and emerging technologies and use this knowledge to inform your work and help your cross-functional team move faster and navigate technical limitations in service of the impactful solutions\n\nCollaboration: Leverage a rich network of partnerships across lines of business and the organization to foster collaboration and share solutions, incorporating cross-functional perspectives to bridge gaps in information and drive product strategy\n\nCommunication: Present work across levels and job functions using a human-centered approach that integrates design frameworks, data and research insights to articulate a compelling point of view that influences strategic decision-making and direction at senior levels\n\nThe ideal candidate has a strong portfolio demonstrating your leadership, process, results and impact.\n\nBasic Qualifications\n• At least 5 years of experience in a Product Design role\n• At least 5 years of experience in design and prototyping tools such as Figma\n\nPreferred Qualifications\n• At least 6 years of experience in a Product Design role\n• At least 6 years of experience in design and prototyping tools such as Figma\n• Experience working with and contributing to an established design system\n• Experience collaborating with product, tech and business partners\n• Experience leading design projects or teams\n• Experience working in heavily regulated, data heavy problem spaces\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nMcLean, VA: $158,400 - $180,800 for Manager, Design\n\nNew York, NY: $172,800 - $197,200 for Manager, Design\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nThis role is expected to accept applications for a minimum of 5 business days.\n\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability\/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).","job_is_remote":false,"job_posted_at":"2 days ago","job_posted_at_timestamp":1762646400,"job_posted_at_datetime_utc":"2025-11-09T00:00:00.000Z","job_location":"McLean, VA","job_city":"McLean","job_state":"Virginia","job_country":"US","job_latitude":38.9338676,"job_longitude":-77.1772604,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D4p8pPyPN3sDYEXBnAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["At least 5 years of experience in a Product Design role","At least 5 years of experience in design and prototyping tools such as Figma"],"Benefits":["Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked","McLean, VA: $158,400 - $180,800 for Manager, Design","Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter","This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI)","Incentives could be discretionary or non discretionary depending on the plan","Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being"],"Responsibilities":["As a Product Designer, you’ll combine your craft expertise and leadership skills with an understanding of our customers and the business to co-create innovative solutions to complex problems and influence product strategy","Product Design Expertise: Demonstrate a high degree of skill in product design, leveraging a variety of skills across interaction, visual and service design; in collaboration with cross-functional partners, inform the use of appropriate tools, platforms, frameworks and design systems and creates artifacts that may include journey maps, blueprints, high-fidelity designs and prototypes","Leadership: Lead design projects, directing and delegating work for more junior team members and building strong partnerships with cross-functional stakeholders while also mentoring and helping to mature the overall product design practice at Capital One","Human-Centered: Effectively navigate the needs of partners and stakeholders, leveraging critical-thinking skills that factor in data, research insights, scalability and tech constraints, while ensuring the team focuses on customer-centered solutions and inclusive design","Business-Focused: Demonstrate proficiency with products and processes and apply relevant insights on customers, competitors and broader market trends to business challenges that shape a shared point of view for your team, partners and stakeholders","Problem-Solving: Demonstrate a solid understanding of tech, data capabilities and emerging technologies and use this knowledge to inform your work and help your cross-functional team move faster and navigate technical limitations in service of the impactful solutions","Collaboration: Leverage a rich network of partnerships across lines of business and the organization to foster collaboration and share solutions, incorporating cross-functional perspectives to bridge gaps in information and drive product strategy","Communication: Present work across levels and job functions using a human-centered approach that integrates design frameworks, data and research insights to articulate a compelling point of view that influences strategic decision-making and direction at senior levels","The ideal candidate has a strong portfolio demonstrating your leadership, process, results and impact"]},"job_onet_soc":"27102100","job_onet_job_zone":"4"},{"job_id":"mDO0s5YRx2CJd7yCAAAAAA==","job_title":"Technical Product Manager, Insights and Analytics","employer_name":"Kroll","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcRjri_jNW74rCzJACcoLdsHYstRiWikfZOAAs_r&s=0","employer_website":"https:\/\/www.kroll.com","job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/technical-product-manager-insights-and-analytics-at-kroll-4312237502?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/technical-product-manager-insights-and-analytics-at-kroll-4312237502?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobright","apply_link":"https:\/\/jobright.ai\/jobs\/info\/68ef04e7a1a1d02df61e8473?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Ladders","apply_link":"https:\/\/www.theladders.com\/job\/technical-product-manager-insights-and-analytics-kroll-washington-dc_83896712?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobrapido","apply_link":"https:\/\/us.jobrapido.com\/jobpreview\/8268981480642838528?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"Adzuna","apply_link":"https:\/\/www.adzuna.com\/details\/5390010127?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/532cab7904a281480b15e2a866816b5b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Learn4Good","apply_link":"https:\/\/www.learn4good.com\/jobs\/washington\/district-of-columbia\/info_technology\/4526950427\/e\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/job\/us-dc-washington-technical-product-manager-insights-analytics-kroll?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"The Reporting, Insights & Analytics team is on a mission to harness the power of data to guide strategic decisions and improve business operations. Reporting directly to the Chief Operating Officer, this team collaborates closely with C-Suite executives and Business Unit leaders to develop products, refine processes, and generate actionable insights on a global scale.\n\nAs a team member, you will play a pivotal role in driving data-driven decision-making across various areas, including Sales & Pipeline, Engagement Economics, and Capacity Planning. Your responsibilities will include working with leadership to establish, measure, and report on Key Performance Indicators (KPIs), ensuring that the organization stays on track with its strategic goals. In addition to analyzing data and identifying trends, you will be responsible for synthesizing business requirements and clearly communicating product designs to the Data Engineers and Data Science teams. This role requires a blend of strong analytical skills, effective communication, and the ability to collaborate with senior leadership and cross-functional teams.\n\nOverall, this position is ideal for someone who is passionate about using data to drive business success and enjoys working in a dynamic, collaborative environment.\n\nRole Overview\n\nAs Product Owner, you will lead the global transformation of Kroll’s Insights & Analytics capabilities—driving the design and delivery of intelligent, data-powered solutions that directly influence strategic decisions across the business. This is a high-visibility role at the forefront of innovation, responsible for shaping how Kroll measures what matters most.\n\nYou will work cross-functionally to ensure that insights are not only technically sound but also actionable, timely, and aligned with business priorities. Your work will empower leaders with the clarity and confidence to make data-informed decisions that move the business forward. From defining KPIs that reflect true value to building feedback loops that drive continuous improvement, you will be instrumental in embedding data into the fabric of how Kroll operates.\n\nDay To Day Responsibilities\n• Define and own the product vision, roadmap, and backlog for cognitive and data-enabled solutions.\n• Collaborate with cross-functional teams including data scientists, engineers, UX designers, and business stakeholders to deliver high-impact features.\n• Translate complex business problems into clear technical requirements and user stories.\n• Prioritize features based on customer value, business impact, and technical feasibility.\n• Monitor product performance and user feedback to inform iterative improvements.\n• Serve as the voice of the customer and advocate for intuitive, inclusive, and scalable solutions.\n\nEssential Traits\n• Proven experience as a Product Owner or Product Manager in a tech-driven environment.\n• Strong understanding of data science, AI\/ML, or cognitive technologies.\n• Ability to communicate fluently across technical and non-technical audiences.\n• Demonstrated success in agile product development and backlog management.\n• Excellent problem-solving, critical thinking, and decision-making skills.\n• Experience with tools like Jira, Confluence, Figma, or similar.\n• Bachelor’s or Master’s degree in Business, Computer Science, Engineering, or related field.\n• A minimum of seven years of experience in product ownership or product management is preferred.\n\nYour recruiter will be happy to walk you through your U.S.-specific benefits, which include:\n• Healthcare Coverage: Comprehensive medical, dental, and vision plans.\n• Time Off and Leave Policies: Generous paid time off (PTO), paid company holidays, generous parental and family leave.\n• Protective Insurances: Life insurance, short- and long-term disability coverage, and accident protection.\n• Compensation and Rewards: Competitive salary structures, performance-based incentives, and merit-based compensation reviews.\n• Retirement Plans: 401(k) plans with company matching.\n\nPlease note that benefits may vary by region, department and role. We encourage you to speak with your recruiter to learn more about the specific benefits available for your position.\n\nAbout Kroll\n\nJoin the global leader in risk and financial advisory solutions—Kroll. With a nearly century-long legacy, we blend trusted expertise with cutting-edge technology to navigate and redefine industry complexities. As a part of One Team, One Kroll, you'll contribute to a collaborative and empowering environment, propelling your career to new heights. Ready to build, protect, restore, and maximize our clients’ value? Your journey begins with Kroll.\n\nIn order to be considered for a position, you must formally apply via careers.kroll.com.\n\nWe are proud to be an equal opportunity employer and will consider all qualified applicants regardless of gender, gender identity, race, religion, color, nationality, ethnic origin, sexual orientation, marital status, veteran status, age or disability.\n\nThe current salary range for this position is $70,000 to $200,000","job_is_remote":false,"job_posted_at":"6 days ago","job_posted_at_timestamp":1762300800,"job_posted_at_datetime_utc":"2025-11-05T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":["health_insurance","paid_time_off","dental_coverage"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DmDO0s5YRx2CJd7yCAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":70000,"job_max_salary":200000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["This role requires a blend of strong analytical skills, effective communication, and the ability to collaborate with senior leadership and cross-functional teams","Overall, this position is ideal for someone who is passionate about using data to drive business success and enjoys working in a dynamic, collaborative environment","Proven experience as a Product Owner or Product Manager in a tech-driven environment","Strong understanding of data science, AI\/ML, or cognitive technologies","Ability to communicate fluently across technical and non-technical audiences","Demonstrated success in agile product development and backlog management","Excellent problem-solving, critical thinking, and decision-making skills","Experience with tools like Jira, Confluence, Figma, or similar","Bachelor’s or Master’s degree in Business, Computer Science, Engineering, or related field"],"Benefits":["Healthcare Coverage: Comprehensive medical, dental, and vision plans","Time Off and Leave Policies: Generous paid time off (PTO), paid company holidays, generous parental and family leave","Protective Insurances: Life insurance, short- and long-term disability coverage, and accident protection","Compensation and Rewards: Competitive salary structures, performance-based incentives, and merit-based compensation reviews","Retirement Plans: 401(k) plans with company matching","The current salary range for this position is $70,000 to $200,000"],"Responsibilities":["The Reporting, Insights & Analytics team is on a mission to harness the power of data to guide strategic decisions and improve business operations","Reporting directly to the Chief Operating Officer, this team collaborates closely with C-Suite executives and Business Unit leaders to develop products, refine processes, and generate actionable insights on a global scale","As a team member, you will play a pivotal role in driving data-driven decision-making across various areas, including Sales & Pipeline, Engagement Economics, and Capacity Planning","Your responsibilities will include working with leadership to establish, measure, and report on Key Performance Indicators (KPIs), ensuring that the organization stays on track with its strategic goals","In addition to analyzing data and identifying trends, you will be responsible for synthesizing business requirements and clearly communicating product designs to the Data Engineers and Data Science teams","As Product Owner, you will lead the global transformation of Kroll’s Insights & Analytics capabilities—driving the design and delivery of intelligent, data-powered solutions that directly influence strategic decisions across the business","You will work cross-functionally to ensure that insights are not only technically sound but also actionable, timely, and aligned with business priorities","Your work will empower leaders with the clarity and confidence to make data-informed decisions that move the business forward","From defining KPIs that reflect true value to building feedback loops that drive continuous improvement, you will be instrumental in embedding data into the fabric of how Kroll operates","Define and own the product vision, roadmap, and backlog for cognitive and data-enabled solutions","Collaborate with cross-functional teams including data scientists, engineers, UX designers, and business stakeholders to deliver high-impact features","Translate complex business problems into clear technical requirements and user stories","Prioritize features based on customer value, business impact, and technical feasibility","Monitor product performance and user feedback to inform iterative improvements","Serve as the voice of the customer and advocate for intuitive, inclusive, and scalable solutions"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"mhD19XThleQ0IDHYAAAAAA==","job_title":"Senior Product Manager, Growth","employer_name":"Scribd","employer_logo":null,"employer_website":"https:\/\/www.scribd.com","job_publisher":"Indeed","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.indeed.com\/viewjob?jk=1e34d42ab0c0d9d5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Indeed","apply_link":"https:\/\/www.indeed.com\/viewjob?jk=1e34d42ab0c0d9d5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Glassdoor","apply_link":"https:\/\/www.glassdoor.com\/job-listing\/senior-product-manager-growth-scribd-JV_IC1138213_KO0,29_KE30,36.htm?jl=1009914595660&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/senior-product-manager-growth-at-scribd-inc-4317138509?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Scribd\/Job\/Senior-Product-Manager,-Growth\/-in-Washington,DC?jid=d8cc0c3dcd92ea5c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"IT JobServe","apply_link":"https:\/\/it.jobserve.com\/job-in-Washington-District-of-Columbia-USA\/SENIOR-PRODUCT-MANAGER-REVENUE-GROWTH-fddde9e2235fe4c56f\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/74c5b7f5d5dc6e28718ee8e15720f270?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"IT Jobs For ColU Fans","apply_link":"https:\/\/itjobs.cu-fc.com\/jobs-for-colu-fans\/SENIOR-PRODUCT-MANAGER-REVENUE-GROWTH-job-in-Washington-District-of-Columbia-USA\/41bcae03a76e5de18a\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/job\/us-dc-washington-senior-product-manager-growth-scribd-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"About The Company:\n\nAt Scribd (pronounced “scribbed”), our mission is to spark human curiosity. Join our team as we create a world of stories and knowledge, democratize the exchange of ideas and information, and empower collective expertise through our four products: Everand, Scribd, Slideshare, and Fable.\n\nWe support a culture where our employees can be real and be bold; where we debate and commit as we embrace plot twists; and where every employee is empowered to take action as we prioritize the customer.\n\nWhen it comes to workplace structure, we believe in balancing individual flexibility and community connections. It’s through our flexible work benefit, Scribd Flex, that employees – in partnership with their manager – can choose the daily work-style that best suits their individual needs. A key tenet of Scribd Flex is our prioritization of intentional in-person moments to build collaboration, culture, and connection. For this reason, occasional in-person attendance is required for all Scribd employees, regardless of their location.\n\nSo what are we looking for in new team members? Well, we hire for “GRIT”. The textbook definition of GRIT is demonstrating the intersection of passion and perseverance towards long term goals. At Scribd, we are inspired by the potential that this can unlock, and ask each of our employees to pursue a GRIT-ty approach to their work. In a tactical sense, GRIT is also a handy acronym that outlines the standards we hold ourselves and each other to. Here’s what that means for you: we’re looking for someone who showcases the ability to set and achieve Goals, achieve Results within their job responsibilities, contribute Innovative ideas and solutions, and positively influence the broader Team through collaboration and attitude.\n\nWe are seeking a talented Senior Product Manager to join our Growth product team, a role that sits at the core of our subscription-based business. This crucial role focuses on refining our funnel strategies to boost subscriber retention and reduce churn. The successful candidate will leverage deep understanding of data-driven experimentation, user behavior and market trends to implement effective growth tactics and retention mechanisms. Your efforts will directly impact our customer experience and business results, reaffirming our commitment to offering the best subscription service to inspire the world through stories and knowledge.\n\nYou will:\n• Lead the development and execution of product strategy and vision to increase subscription growth and improve retention rates, leveraging insights into customer behavior and market trends.\n• Continuously optimize the subscription journey, identifying pain points and opportunities to improve the user experience and increase conversion.\n• Leverage data and analytics to guide decisions, identify growth opportunities, and establish clear success metrics.\n• Drive product strategy in ambiguous settings, employing product management frameworks to clarify objectives, mediate diverse viewpoints, and propel product growth and user engagement.\n• Understand customer needs and behaviors by conducting research, data analysis, and usability testing to inform strategies to reduce friction along the key steps of customer journey.\n• Collaborate cross-functionally with Design, Analytics, Product Marketing, Engineering and Customer Service teams.\n\nYou have:\n• 5+ years of experience in product management, with 2-3 years in a Growth role, preferably in a subscription business.\n• Deep knowledge of growth experimentation tactics, with a strong understanding of the customer journey, and a proven track record of driving subscriber growth and retention.\n• Strong proficiency in data analytics, A\/B testing, experimentation, and funnel optimization.\n• Experience developing pricing and packaging strategies that drive revenue growth and deliver strong global price-to-value for users.\n• Experience working with loyalty programs.\n• Knowledge of product management frameworks and their practical applications.\n• Familiarity with user experience best practices, with a keen eye for intuitive design and user journeys. Experience conducting user research and usability testing.\n• Exceptional cross-functional collaboration skills.\n\nAt Scribd, your base pay is one part of your total compensation package and is determined within a range. Our pay ranges are based on the local cost of labor benchmarks for each specific role, level, and geographic location. San Francisco is our highest geographic market in the United States. In the state of California, the reasonably expected salary range is between $139,000 [minimum salary in our lowest geographic market within California] to $216,500 [maximum salary in our highest geographic market within California].\n\nIn the United States, outside of California, the reasonably expected salary range is between $114,500 [minimum salary in our lowest US geographic market outside of California] to $205,500 [maximum salary in our highest US geographic market outside of California].\n\nIn Canada, the reasonably expected salary range is between $145,000 CAD[minimum salary in our lowest geographic market] to $192,500 CAD[maximum salary in our highest geographic market].\n\nWe carefully consider a wide range of factors when determining compensation, including but not limited to experience; job-related skill sets; relevant education or training; and other business and organizational needs. The salary range listed is for the level at which this job has been scoped. In the event that you are considered for a different level, a higher or lower pay range would apply. This position is also eligible for a competitive equity ownership, and a comprehensive and generous benefits package.\n\nWorking at Scribd, inc.\n\nAre you currently based in a location where Scribd is able to employ you?\nEmployees must have their primary residence in or near one of the following cities. This includes surrounding metro areas or locations within a typical commuting distance:\n\nUnited States:\n\nAtlanta | Austin | Boston | Dallas | Denver | Chicago | Houston | Jacksonville | Los Angeles | Miami | New York City | Phoenix | Portland | Sacramento | Salt Lake City | San Diego | San Francisco | Seattle | Washington D.C.\n\nCanada:\n\nOttawa | Toronto | Vancouver\n\nMexico:\n\nMexico City\n\nBenefits, Perks, and Wellbeing at Scribd\n• Benefits\/perks listed may vary depending on the nature of your employment with Scribd and the geographical location where you work.\n• Healthcare Insurance Coverage (Medical\/Dental\/Vision): 100% paid for employees\n• 12 weeks paid parental leave\n• Short-term\/long-term disability plans\n• 401k\/RSP matching\n• Onboarding stipend for home office peripherals + accessories\n• Learning & Development allowance\n• Learning & Development programs\n• Quarterly stipend for Wellness, WiFi, etc.\n• Mental Health support & resources\n• Free subscription to the Scribd Inc. suite of products\n• Referral Bonuses\n• Book Benefit\n• Sabbaticals\n• Company-wide events\n• Team engagement budgets\n• Vacation & Personal Days\n• Paid Holidays (+ winter break)\n• Flexible Sick Time\n• Volunteer Day\n• Company-wide Employee Resource Groups and programs that foster an inclusive and diverse workplace.\n• Access to AI Tools: We provide free access to best-in-class AI tools, empowering you to boost productivity, streamline workflows, and accelerate bold innovation.\n\nWant to learn more about life at Scribd? www.linkedin.com\/company\/scribd\/life\n\nWe want our interview process to be accessible to everyone. You can inform us of any reasonable adjustments we can make to better accommodate your needs by emailing accommodations@scribd.com about the need for adjustments at any point in the interview process.\n\nScribd is committed to equal employment opportunity regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage people of all backgrounds to apply, and believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.","job_is_remote":false,"job_posted_at":"21 days ago","job_posted_at_timestamp":1761004800,"job_posted_at_datetime_utc":"2025-10-21T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":["health_insurance","dental_coverage"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DmhD19XThleQ0IDHYAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":114000,"job_max_salary":216000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["5+ years of experience in product management, with 2-3 years in a Growth role, preferably in a subscription business","Deep knowledge of growth experimentation tactics, with a strong understanding of the customer journey, and a proven track record of driving subscriber growth and retention","Strong proficiency in data analytics, A\/B testing, experimentation, and funnel optimization","Experience developing pricing and packaging strategies that drive revenue growth and deliver strong global price-to-value for users","Experience working with loyalty programs","Knowledge of product management frameworks and their practical applications","Familiarity with user experience best practices, with a keen eye for intuitive design and user journeys","Experience conducting user research and usability testing","Exceptional cross-functional collaboration skills","This includes surrounding metro areas or locations within a typical commuting distance:"],"Benefits":["At Scribd, your base pay is one part of your total compensation package and is determined within a range","Our pay ranges are based on the local cost of labor benchmarks for each specific role, level, and geographic location","In the state of California, the reasonably expected salary range is between $139,000 [minimum salary in our lowest geographic market within California] to $216,500 [maximum salary in our highest geographic market within California]","In the United States, outside of California, the reasonably expected salary range is between $114,500 [minimum salary in our lowest US geographic market outside of California] to $205,500 [maximum salary in our highest US geographic market outside of California]","In Canada, the reasonably expected salary range is between $145,000 CAD[minimum salary in our lowest geographic market] to $192,500 CAD[maximum salary in our highest geographic market]","We carefully consider a wide range of factors when determining compensation, including but not limited to experience; job-related skill sets; relevant education or training; and other business and organizational needs","This position is also eligible for a competitive equity ownership, and a comprehensive and generous benefits package","Benefits\/perks listed may vary depending on the nature of your employment with Scribd and the geographical location where you work","Healthcare Insurance Coverage (Medical\/Dental\/Vision): 100% paid for employees","12 weeks paid parental leave","Short-term\/long-term disability plans","401k\/RSP matching","Onboarding stipend for home office peripherals + accessories","Learning & Development allowance","Learning & Development programs","Quarterly stipend for Wellness, WiFi, etc","Mental Health support & resources","Free subscription to the Scribd Inc. suite of products","Referral Bonuses","Book Benefit","Sabbaticals","Company-wide events","Team engagement budgets","Vacation & Personal Days","Paid Holidays (+ winter break)","Flexible Sick Time","Volunteer Day","Company-wide Employee Resource Groups and programs that foster an inclusive and diverse workplace","Access to AI Tools: We provide free access to best-in-class AI tools, empowering you to boost productivity, streamline workflows, and accelerate bold innovation"],"Responsibilities":["This crucial role focuses on refining our funnel strategies to boost subscriber retention and reduce churn","The successful candidate will leverage deep understanding of data-driven experimentation, user behavior and market trends to implement effective growth tactics and retention mechanisms","Your efforts will directly impact our customer experience and business results, reaffirming our commitment to offering the best subscription service to inspire the world through stories and knowledge","Lead the development and execution of product strategy and vision to increase subscription growth and improve retention rates, leveraging insights into customer behavior and market trends","Continuously optimize the subscription journey, identifying pain points and opportunities to improve the user experience and increase conversion","Leverage data and analytics to guide decisions, identify growth opportunities, and establish clear success metrics","Drive product strategy in ambiguous settings, employing product management frameworks to clarify objectives, mediate diverse viewpoints, and propel product growth and user engagement","Understand customer needs and behaviors by conducting research, data analysis, and usability testing to inform strategies to reduce friction along the key steps of customer journey","Collaborate cross-functionally with Design, Analytics, Product Marketing, Engineering and Customer Service teams"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"t2RKt47Sz_Hvk9ObAAAAAA==","job_title":"Senior Associate, Product Manager, Debit Decisioning","employer_name":"Capital One","employer_logo":null,"employer_website":"https:\/\/www.capitalone.com","job_publisher":"Capital One Careers","job_employment_type":"Full-time and Part-time","job_employment_types":["FULLTIME","PARTTIME"],"job_apply_link":"https:\/\/www.capitalonecareers.com\/job\/mclean\/senior-associate-product-manager-debit-decisioning\/1732\/88214580080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Capital One Careers","apply_link":"https:\/\/www.capitalonecareers.com\/job\/mclean\/senior-associate-product-manager-debit-decisioning\/1732\/88214580080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/senior-associate-product-manager-debit-decisioning-at-capital-one-4334939011?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Capitalone\/Job\/Senior-Associate,-Product-Manager,-Debit-Decisioning\/-in-New-York,NY?jid=9499a20a42b23061&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Built In","apply_link":"https:\/\/builtin.com\/job\/senior-associate-product-manager-debit-decisioning\/7648304?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"FOX8 Jobs","apply_link":"https:\/\/jobs.fox8.com\/jobs\/senior-product-manager-small-business-bank-fraud-decisioning-new-york\/2447992299-2\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/product-development?id=2255461618&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"FOX4KC Jobs","apply_link":"https:\/\/jobs.fox4kc.com\/jobs\/senior-product-manager-small-business-bank-fraud-decisioning-new-york\/2447992299-2\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/c7214f9059ee0b71aee2346aea3f6953?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Senior Associate, Product Manager, Debit Decisioning\n\nProduct Management at Capital One is a booming, vibrant craft that requires reimagining the status quo, finding value creation opportunities, and driving innovative and sustainable customer experiences through technology. We believe our portfolio of businesses and investments in growth and transformation will result in a company with the scale, brand, capabilities, talent, and values to succeed as the digital revolution transforms our society and our industry.\n\nAbout the Debit Authorizations Decisioning Team:\n\nEvery time our customers use their debit cards we make a decision - should we allow this transaction to go through? Our mission is twofold: make it seamless for good customers to use their debit cards to spend and manage their money, and impossible for bad actors to do so. To accomplish this, we build the intelligent data-driven brain behind authorizations, managing the policies, models, and data integrations that power our automated decisions. We are a team of strategists, builders, and customer advocates who thrive on solving complex problems at the intersection of technology, data, and human experience. The Debit Authorizations Decisioning Product Manager will focus on building additional data sources for our models and decisioning and partnering with downstream teams to improve the “post-decline” experience. This is a highly collaborative role, who will work closely with product managers across Capital One in the Retail Bank and Enterprise teams, engineers, data scientists, operations, and business partners to continue to evolve our debit authorizations platform and strategy.\n\nCapital One Product Framework\n\nIn this role, you’ll be expected to demonstrate proficiency in five key areas which we consider to be the foundation for successful Product management:\n• Human Centered - Obsesses about internal and external customer needs to reimagine and innovate product solutions\n• Business Focused - Delivers game-changing outcomes by focusing on leverage and execution excellence\n• Technology Driven - Leverages technology to deliver innovative and resilient solutions that enable both near term and long term value\n• Integrated Problem Solving - Identifies and resolves complex problems to deliver outcomes while mitigating product risks\n• Transformational Leadership - Leads cross functional teams to solve customer problems and drive organizational alignment\n\nBasic Qualifications:\n• Bachelor’s Degree or military experience\n• At least 2 years of experience working in Product Management\n\nPreferred Qualifications:\n• Bachelor’s degree in computer science or engineering\n• Experience translating business strategy and analysis into consumer facing digital products\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nMcLean, VA: $109,000 - $124,400 for Sr. Associate, Product Management\n\nNew York, NY: $118,900 - $135,700 for Sr. Associate, Product Management\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nThis role is expected to accept applications for a minimum of 5 business days.\n\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability\/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).","job_is_remote":false,"job_posted_at":"4 days ago","job_posted_at_timestamp":1762473600,"job_posted_at_datetime_utc":"2025-11-07T00:00:00.000Z","job_location":"McLean, VA","job_city":"McLean","job_state":"Virginia","job_country":"US","job_latitude":38.9338676,"job_longitude":-77.1772604,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3Dt2RKt47Sz_Hvk9ObAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Human Centered - Obsesses about internal and external customer needs to reimagine and innovate product solutions","Bachelor’s Degree or military experience","At least 2 years of experience working in Product Management"],"Benefits":["Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked","McLean, VA: $109,000 - $124,400 for Sr","New York, NY: $118,900 - $135,700 for Sr","Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter","This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI)","Incentives could be discretionary or non discretionary depending on the plan","Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being"],"Responsibilities":["The Debit Authorizations Decisioning Product Manager will focus on building additional data sources for our models and decisioning and partnering with downstream teams to improve the “post-decline” experience","This is a highly collaborative role, who will work closely with product managers across Capital One in the Retail Bank and Enterprise teams, engineers, data scientists, operations, and business partners to continue to evolve our debit authorizations platform and strategy","Capital One Product Framework","In this role, you’ll be expected to demonstrate proficiency in five key areas which we consider to be the foundation for successful Product management:","Technology Driven - Leverages technology to deliver innovative and resilient solutions that enable both near term and long term value","Integrated Problem Solving - Identifies and resolves complex problems to deliver outcomes while mitigating product risks","Transformational Leadership - Leads cross functional teams to solve customer problems and drive organizational alignment"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"},{"job_id":"8Zcyf0knL9AcLZG0AAAAAA==","job_title":"Sr. Product Manager, AWS Global Services Security","employer_name":"Amazon Web Services (AWS)","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcRDhrsiwqZ87o_GbEtiPnJBd_9_wDeh86Wk6uMM&s=0","employer_website":"https:\/\/aws.amazon.com","job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/sr-product-manager-aws-global-services-security-at-amazon-web-services-aws-4289139359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/sr-product-manager-aws-global-services-security-at-amazon-web-services-aws-4289139359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"SimplyHired","apply_link":"https:\/\/www.simplyhired.com\/job\/paw7ueo1Om8YuLzCYmnVMl6J1K9cGUa5JlizBj_ebZKYxUgWEi89Jw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Bandana.com","apply_link":"https:\/\/bandana.com\/jobs\/a024eca4-84b5-4189-82f0-a8d2fa4a6487?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/1695c237037c8c078d4c02e55ab2d62b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Description\n\nThe AWS Security Incident Response service team is dedicated to helping customers prepare for, respond to, and recover from security events. We leverage AWS's expertise and ingenuity to establish automated, scalable security incident response solutions that drive superior security outcomes for our customers. Our mission is to provide world-class incident response capabilities and build innovative security automation that helps protect organizations worldwide.\n\nIn this role, you will be responsible for imagining, designing, and building the next generation of incident response capabilities within AWS Security Incident Response. You will be the voice of the customer within AWS, prioritizing development of new products and features, defining requirements, guiding engineering teams, and building go-to-market strategy. This role will be visible at the highest levels of the company and requires coordination across many internal and external teams.\n\nAWS Global Services includes experts from across AWS who help our customers design, build, operate, and secure their cloud environments. Customers innovate with AWS Professional Services, upskill with AWS Training and Certification, optimize with AWS Support and Managed Services, and meet objectives with AWS Security Assurance Services. Our expertise and emerging technologies include AWS Partners, AWS Sovereign Cloud, AWS International Product, and the Generative AI Innovation Center. You’ll join a diverse team of technical experts in dozens of countries who help customers achieve more with the AWS cloud.\n\nKey job responsibilities\n\nA successful candidate will be highly analytical, strategic, and adept at managing multiple work streams at the same time in order to build repeatable and scalable processes and mechanisms.\n\nYou will be spending time with customers (internal and external) to understand their needs, and to define innovative solutions that meet customer’s requirements.\n\nYou are able to influence technical priorities and business strategy through data-driven contributions to achieve a desired customer or business outcome.\n\nYou will build strong relationships with security partners and the AWS partner ecosystem to enhance incident response capabilities.\n\nYou will collaborate with engineering teams to enhance the integration between AWS Security Incident Response and other AWS security services.\n\nYou have experience solving complex business challenges and constantly improving the customer experience.\n\nYou will work closely with multiple engineering teams and designers to deliver results to customer.\n\nYou will create the vision, product strategy and road map for our products and working with key stakeholders in the company to deliver on that vision, e.g. sales, partner team, etc.\n\nYou will build the go-to-market plan and work to ensure that sales, SAs, and the partner teams have what they need to be successful.\n\nAbout The Team\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork\/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\n\nBasic Qualifications\n• 5+ years of technical product management with internet business experience\n• 5+ years of working as a Technical Product Manager experience\n• 3+ years of technical (software development, network development, IT, other related) experience\n• Experience in taking a product from conception & definition phase through engineering design and taking it to market\n• Experience delivering large-scale SaaS, PaaS or LaaS products where you are responsible for the full product lifecycle, from concept through GTM (go to market)\n\nPreferred Qualifications\n• Master's degree in computer science, information systems or business\n• Ability to influence a wide range of stakeholders to align across a singular vision to provide customers with a consistent product experience\n• Security and compliance domain knowledge preferred\n• Hands-on experience with AWS Services\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https:\/\/amazon.jobs\/content\/en\/how-we-hire\/accommodations for more information. If the country\/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $137,000\/year in our lowest geographic market up to $236,800\/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits. For more information, please visit https:\/\/www.aboutamazon.com\/workplace\/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\nCompany - Amazon Web Services, Inc.\n\nJob ID: A3045313","job_is_remote":false,"job_posted_at":"19 days ago","job_posted_at_timestamp":1761177600,"job_posted_at_datetime_utc":"2025-10-23T00:00:00.000Z","job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D8Zcyf0knL9AcLZG0AAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":137000,"job_max_salary":237000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["5+ years of technical product management with internet business experience","5+ years of working as a Technical Product Manager experience","3+ years of technical (software development, network development, IT, other related) experience","Experience in taking a product from conception & definition phase through engineering design and taking it to market","Experience delivering large-scale SaaS, PaaS or LaaS products where you are responsible for the full product lifecycle, from concept through GTM (go to market)","These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation"],"Benefits":["Work\/Life Balance","We value work-life harmony","The base pay for this position ranges from $137,000\/year in our lowest geographic market up to $236,800\/year in our highest geographic market","Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits"],"Responsibilities":["In this role, you will be responsible for imagining, designing, and building the next generation of incident response capabilities within AWS Security Incident Response","You will be the voice of the customer within AWS, prioritizing development of new products and features, defining requirements, guiding engineering teams, and building go-to-market strategy","This role will be visible at the highest levels of the company and requires coordination across many internal and external teams","A successful candidate will be highly analytical, strategic, and adept at managing multiple work streams at the same time in order to build repeatable and scalable processes and mechanisms","You will be spending time with customers (internal and external) to understand their needs, and to define innovative solutions that meet customer’s requirements","You are able to influence technical priorities and business strategy through data-driven contributions to achieve a desired customer or business outcome","You will build strong relationships with security partners and the AWS partner ecosystem to enhance incident response capabilities","You will collaborate with engineering teams to enhance the integration between AWS Security Incident Response and other AWS security services","You have experience solving complex business challenges and constantly improving the customer experience","You will work closely with multiple engineering teams and designers to deliver results to customer","You will create the vision, product strategy and road map for our products and working with key stakeholders in the company to deliver on that vision, e.g. sales, partner team, etc","You will build the go-to-market plan and work to ensure that sales, SAs, and the partner teams have what they need to be successful"]},"job_onet_soc":"11202100","job_onet_job_zone":"4"}]}