{"status":"OK","request_id":"1fdb1e0f-b37b-43bf-bc25-e3eff3887141","parameters":{"query":"Supply Chain Manager","page":1,"num_pages":1,"country":"us","language":"en"},"data":[{"job_id":"q-jzMe30aex-ucY3AAAAAA==","job_title":"Manager, Supply Chain Warehousing & Logistics Business Systems","employer_name":"Washington Metropolitan Area Transit Authority (WMATA)","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcTZYNvIzvXgzfvJFbAt7hbGzX0-NFsATO4rWTLa&s=0","employer_website":null,"job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/manager-supply-chain-warehousing-logistics-business-systems-at-washington-metropolitan-area-transit-authority-wmata-4337739941?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/manager-supply-chain-warehousing-logistics-business-systems-at-washington-metropolitan-area-transit-authority-wmata-4337739941?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jooble","apply_link":"https:\/\/jooble.org\/rjdp\/5031190136018874198?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Bandana.com","apply_link":"https:\/\/bandana.com\/jobs\/b9615a64-fca0-4312-8c2b-7b68f0f35f34?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobrapido","apply_link":"https:\/\/us.jobrapido.com\/jobpreview\/9086651152522543104?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/job\/us-dc-washington-manager-supply-chain-warehousing-logistics-business?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Learn4Good","apply_link":"https:\/\/www.learn4good.com\/jobs\/washington\/district-of-columbia\/management_and_managerial\/4578146890\/e\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Job Description\n\nMarketing Statement\n\nJoin a mission-driven organization where your expertise in SCM systems and process improvement directly supports a safe, reliable transportation network for the region. As the leader of supply chain business systems, you will modernize technology, strengthen warehouse performance, and empower frontline and management staff through training and innovation. You'll partner across operations and IT to streamline workflows, enhance data accuracy, and drive continuous improvement in a dynamic logistics environment. If you're a strategic problem-solver who thrives at the intersection of technology, operations, and people development, this role offers meaningful impact and room to lead.\n\nMinimum Qualifications\n\nEducation\n• Bachelor's Degree in Business Management, Supply Chain Management, Finance, Information Technology, or related field\n• In lieu of a bachelor¿s degree, a high school diploma or GED and four (4) years of experience in managing a warehousing and logistics business unit\n\nExperience\n• Five (5) years of experience in warehousing and logistics environment, including at least three (3) years of management experience\n\nCertification\/Licensure\n• Possession of a valid motor vehicle operator¿s license issued from the jurisdiction of residence\n\nPreferred\n• Project Management Professional (PMP) Certification\n• Lean Six Sigma Green Belt\n• APICS CLTD Certification or similar Supply Chain Certification from ISM or APICS\n\nMedical Group\n\nSatisfactorily complete the medical examination for this position, if required. The incumbent must be able to perform the essential functions of this position either with or without reasonable accommodations.\n\nJob Summary\n\nThe Manager, Supply Chain Warehousing and Logistics Business Systems monitors and manages the Office of Supply Chain Warehousing and Logistics (SCWL) business systems, including people, process, technology, and infrastructure. The incumbent maintains these business systems and provides leadership and recommendations for improving all aspects of the supply chain.\n\nEssential Functions\n• Serves as subject matter expert on warehouse management system (WMS) software application and other applications that support WMATA¿s storerooms and warehouses.\n• Develops curriculum, recruits, and implements a formal training program for SCWL team members at frontline and management levels.\n• Serves as the project manager for special projects, including implementation of a Warehouse Management System (WMS), new warehouse designs and builds, state of good repair program, and other projects as assigned.\n• Develops and implements all SCWL Standard Operating Procedures, Staff Notices, and SCWL Bulletins impacting business systems.\n• Serves as functional expert and analyst for direct and integrated software applications, storeroom automated systems, and as liaison to the Office of Information Technology (IT) and other Supply Chain Management Offices.\n• Leads and facilitates all audit responses conducted by internal and\/or external entities resulting in corrective action measures for SCWL.\n• Serves as the primary contact for day-to-day warehouse and storeroom system applications and integration to help resolve issues; tracks trends and identifies root causes, and provides corrective action. Clarifies and answers user questions and requests.\n• Performs a variety of complex and independent activities involved in the data collection, analysis, documentation, and interpretation of warehouse and storerooms management function and performance.\n• Provides process analysis and recommends enhancements to ensure that all procedures and processes are working efficiently. Applies change management practices when implementing enhancements.\n• Interacts regularly with end users, engages in troubleshooting and provides continuous improvements to all aspects of the design and process impacting warehouse performance.\n\nOther Functions\n• Gathers and develops functional requirements and documents them to translate departmental needs and requirements into actionable information for other departments.\n• Operates Authority vehicle between work locations to perform job duties as required.\n• The essential duties listed are not intended to limit specific duties and responsibilities of any particular position. Nor is it intended to limit in any way the right of managers and supervisors to assign, direct and control the work of employees under their supervision.\n\nEvaluation Criteria\n\nConsideration will be given to applicants whose resumes demonstrate the required education and experience. Applicants should include all relevant education and work experience.\n\nEvaluation criteria may include one or more of the following:\n• Skills and\/or behavioral assessment\n• Personal interview\n• Verification of education and experience (including certifications and licenses)\n• Criminal Background Check (a criminal conviction is not an automatic bar to employment)\n• Medical examination including a drug and alcohol screening (for safety sensitive positions)\n• Review of a current motor vehicle report\n\nClosing\n\nWMATA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, status as a protected veteran, or any other status protected by applicable federal law.\n\nThis posting is an announcement of a vacant position under recruitment. It is not intended to replace the official job description. Job descriptions are available upon confirmation of an interview.","job_is_remote":false,"job_posted_at":"8 days ago","job_posted_at_timestamp":1762300800,"job_posted_at_datetime_utc":"2025-11-05T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":null,"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3Dq-jzMe30aex-ucY3AAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Bachelor's Degree in Business Management, Supply Chain Management, Finance, Information Technology, or related field","In lieu of a bachelor¿s degree, a high school diploma or GED and four (4) years of experience in managing a warehousing and logistics business unit","Five (5) years of experience in warehousing and logistics environment, including at least three (3) years of management experience","Possession of a valid motor vehicle operator¿s license issued from the jurisdiction of residence","Satisfactorily complete the medical examination for this position, if required","The incumbent must be able to perform the essential functions of this position either with or without reasonable accommodations","Consideration will be given to applicants whose resumes demonstrate the required education and experience","Applicants should include all relevant education and work experience","Skills and\/or behavioral assessment","Personal interview","Verification of education and experience (including certifications and licenses)","Criminal Background Check (a criminal conviction is not an automatic bar to employment)"],"Responsibilities":["As the leader of supply chain business systems, you will modernize technology, strengthen warehouse performance, and empower frontline and management staff through training and innovation","You'll partner across operations and IT to streamline workflows, enhance data accuracy, and drive continuous improvement in a dynamic logistics environment","If you're a strategic problem-solver who thrives at the intersection of technology, operations, and people development, this role offers meaningful impact and room to lead","The Manager, Supply Chain Warehousing and Logistics Business Systems monitors and manages the Office of Supply Chain Warehousing and Logistics (SCWL) business systems, including people, process, technology, and infrastructure","The incumbent maintains these business systems and provides leadership and recommendations for improving all aspects of the supply chain","Serves as subject matter expert on warehouse management system (WMS) software application and other applications that support WMATA¿s storerooms and warehouses","Develops curriculum, recruits, and implements a formal training program for SCWL team members at frontline and management levels","Serves as the project manager for special projects, including implementation of a Warehouse Management System (WMS), new warehouse designs and builds, state of good repair program, and other projects as assigned","Develops and implements all SCWL Standard Operating Procedures, Staff Notices, and SCWL Bulletins impacting business systems","Serves as functional expert and analyst for direct and integrated software applications, storeroom automated systems, and as liaison to the Office of Information Technology (IT) and other Supply Chain Management Offices","Leads and facilitates all audit responses conducted by internal and\/or external entities resulting in corrective action measures for SCWL","Serves as the primary contact for day-to-day warehouse and storeroom system applications and integration to help resolve issues; tracks trends and identifies root causes, and provides corrective action","Clarifies and answers user questions and requests","Performs a variety of complex and independent activities involved in the data collection, analysis, documentation, and interpretation of warehouse and storerooms management function and performance","Provides process analysis and recommends enhancements to ensure that all procedures and processes are working efficiently","Applies change management practices when implementing enhancements","Interacts regularly with end users, engages in troubleshooting and provides continuous improvements to all aspects of the design and process impacting warehouse performance","Gathers and develops functional requirements and documents them to translate departmental needs and requirements into actionable information for other departments","Operates Authority vehicle between work locations to perform job duties as required","The essential duties listed are not intended to limit specific duties and responsibilities of any particular position","Nor is it intended to limit in any way the right of managers and supervisors to assign, direct and control the work of employees under their supervision"]},"job_onet_soc":"13108100","job_onet_job_zone":"4"},{"job_id":"TYmW6Q1TO9v8KjdpAAAAAA==","job_title":"Connected Supply Chain - TMS Logistics, Manager","employer_name":"PRICE WATERHOUSE COOPERS","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcRr9_DiLDMJkqd6ivNyyUtoI-tMbkDpHvVJRbNP&s=0","employer_website":null,"job_publisher":"Indeed","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.indeed.com\/viewjob?jk=6e5850a5945b661a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Indeed","apply_link":"https:\/\/www.indeed.com\/viewjob?jk=6e5850a5945b661a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Pwc\/Job\/Connected-Supply-Chain-TMS-Logistics,-Manager\/-in-Washington,DC?jid=19c9601fb0132aca&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/connected-supply-chain-tms-logistics-manager-at-pwc-4317446301?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"SimplyHired","apply_link":"https:\/\/www.simplyhired.com\/job\/yPNuMvCiq-8PJV-K5SMeXBOBlt5TKtdyMdlTdygYSYou_QxLQFtTFA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Bandana.com","apply_link":"https:\/\/bandana.com\/jobs\/03ddc636-a0f7-4cc8-b9f0-6ddc7d420e67?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Glassdoor","apply_link":"https:\/\/www.glassdoor.com\/job-listing\/connected-supply-chain-tms-logistics-manager-pwc-JV_IC1138213_KO0,44_KE45,48.htm?jl=1009889027000&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Ladders","apply_link":"https:\/\/www.theladders.com\/job\/connected-supply-chain-tms-logistics-manager-pwc-washington-dc_83612513?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/f24f44abd4f3567af377e72706ea85a9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"A career in Connected Supply Chain, within Operations Consulting, will provide you with the opportunity to help our clients optimise all elements of their operations to move beyond the role of a cost effective business enabler and become a source of competitive advantages. We focus on product innovation and development, supply chain, procurement and sourcing, manufacturing operations, service operations and capital asset programmes to drive both growth and profitability. You'll be a part of a team that helps organisations in transforming their supply chains into a strategic asset. You’ll work with our clients to develop a supply chain strategy, optimise their supply chain footprint and logistics, manage transportation and distribution, and develop an integrated business planning solutions.\n\nTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.\n\nAs a Manager, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:\n• Develop new skills outside of comfort zone.\n• Act to resolve issues which prevent the team working effectively.\n• Coach others, recognise their strengths, and encourage them to take ownership of their personal development.\n• Analyse complex ideas or proposals and build a range of meaningful recommendations.\n• Use multiple sources of information including broader stakeholder views to develop solutions and recommendations.\n• Address sub-standard work or work that does not meet firm's\/client's expectations.\n• Use data and insights to inform conclusions and support decision-making.\n• Develop a point of view on key global trends, and how they impact clients.\n• Manage a variety of viewpoints to build consensus and create positive outcomes for all parties.\n• Simplify complex messages, highlighting and summarising key points.\n• Uphold the firm's code of ethics and business conduct.\n\nJob Requirements and Preferences:\n\nBasic Qualifications:\n\nMinimum Degree Required:\nBachelor Degree\n\nRequired Fields of Study:\nEconomics, Business Administration\/Management, Engineering, Management, Operations Management\/Research, Supply Chain Management, Data Processing\/Analytics\/Science\n\nMinimum Years of Experience:\n6 year(s)\n\nPreferred Qualifications:\n\nDegree Preferred:\nMaster Degree\n\nPreferred Fields of Study:\nSupply Chain Management, Operations Management\/Research, Industrial Engineering\n\nCertification(s) Preferred:\n\nCertified Supply Chain Management Professional (CSCMP), American Production and Inventory Control Society (APICS), Institute for Supply Management (ISM)\n\nPreferred Knowledge\/Skills:\n\nDemonstrates extensive abilities and\/or a proven record of success with Supply Chain Logistics including demonstrated knowledge and understanding of the following skillsets:\n• Defining, designing, and reviewing warehouse and transportation operations, processes, operating model, product flow, planning processes including forecasting, demand planning, supply planning, S&OP \/ S&OE, capacity planning, inventory planning, and Integrated Business Planning;\n• Leveraging Blue Yonder Transportation Management Systems (TMS) knowledge to assist clients in the implementation and support of TMS packaged solutions, with emphasis on designing, implementing, and supporting Supply Chain processes and solutions;\n• Significant experience with leading clients and project teams in Blue Yonder TMS testing, User Acceptance testing, training development and delivery;\n• Knowledge and experience working with multiple top to mid-tier TMS vendors and experience leading and delivering TMS projects with the vendors;\n• Demonstrated excellence in project management, leading direct and indirect reports in a matrixed and multi-echelon environments through the design and implementation of people, process and technology changes to the logistics and warehousing functions at our clients;\n• Proven capabilities to work with complex planning data and analytical tools (e.g O9, Blue Yonder, Kinaxis, Excel, PowerBI, Alteryx, etc.) to identify overall supply chain and facility design opportunities, model alternative approaches, and lead business case development to support design decisions and investment requirements;\n• Managerial-level leadership experience with recognized TMS, WCS and WES vendor systems; and,\n• Understanding of overall supply chain market best practices related to transportation, warehousing, and distribution trends and how the systems integrate in to various systems including ERP, TMS, and automation controls.\n\nDemonstrates extensive abilities and\/or a proven record of success with managing the identification and addressing of client needs with a focus on design, process, and technology changes to supply chain organizations by:\n• Leading teams to generate a vision for supply chain strategy;\n• Establish direction and motivate internal and external team members, create an atmosphere of trust, leverage diverse views, coach staff, and encourage improvement and innovation;\n• Participating in client discussions and meetings, managing engagements including preparing concise, accurate documents, conducting analytics associated with planning processes and balancing project economics management with the occurrence of unanticipated issues;\n• Creating a positive environment by monitoring workloads of the team while meeting client expectations and respecting the work-life quality of team members; providing candid, meaningful feedback in a timely manner; and,\n• Keeping leadership informed of progress and issues.\n\nLearn more about how we work: https:\/\/pwc.to\/how-we-work\n\nPwC does not intend to hire experienced or entry level job seekers who will need, now or in the future, PwC sponsorship through the H-1B lottery, except as set forth within the following policy: https:\/\/pwc.to\/H-1B-Lottery-Policy.\n\nAs PwC is an equal opportunity employer, all qualified applicants will receive consideration for employment at PwC without regard to race; color; religion; national origin; sex (including pregnancy, sexual orientation, and gender identity); age; disability; genetic information (including family medical history); veteran, marital, or citizenship status; or, any other status protected by law.\n\nFor only those qualified applicants that are impacted by the Los Angeles County Fair Chance Ordinance for Employers, the Los Angeles' Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, San Diego County Fair Chance Ordinance, and the California Fair Chance Act, where applicable, arrest or conviction records will be considered for Employment in accordance with these laws. At PwC, we recognize that conviction records may have a direct, adverse, and negative relationship to responsibilities such as accessing sensitive company or customer information, handling proprietary assets, or collaborating closely with team members. We evaluate these factors thoughtfully to establish a secure and trusted workplace for all.\n\nApplications will be accepted until the position is filled or the posting is removed, unless otherwise set forth on the following webpage. Please visit this link for information about anticipated application deadlines: https:\/\/pwc.to\/us-application-deadlines\n\nThe salary range for this position is: $99,000 - $232,000, plus individuals may be eligible for an annual discretionary bonus. For roles that are based in Maryland, this is the listed salary range for this position. Actual compensation within the range will be dependent upon the individual's skills, experience, qualifications and location, and applicable employment laws. PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation, personal and family sick leave, and more. To view our benefits at a glance, please visit the following link: https:\/\/pwc.to\/benefits-at-a-glance","job_is_remote":false,"job_posted_at":null,"job_posted_at_timestamp":null,"job_posted_at_datetime_utc":null,"job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":["paid_time_off","health_insurance","dental_coverage"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DTYmW6Q1TO9v8KjdpAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":99000,"job_max_salary":232000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["Economics, Business Administration\/Management, Engineering, Management, Operations Management\/Research, Supply Chain Management, Data Processing\/Analytics\/Science","6 year(s)","Master Degree","Supply Chain Management, Operations Management\/Research, Industrial Engineering","Certified Supply Chain Management Professional (CSCMP), American Production and Inventory Control Society (APICS), Institute for Supply Management (ISM)","Demonstrates extensive abilities and\/or a proven record of success with Supply Chain Logistics including demonstrated knowledge and understanding of the following skillsets:","Defining, designing, and reviewing warehouse and transportation operations, processes, operating model, product flow, planning processes including forecasting, demand planning, supply planning, S&OP \/ S&OE, capacity planning, inventory planning, and Integrated Business Planning;","Leveraging Blue Yonder Transportation Management Systems (TMS) knowledge to assist clients in the implementation and support of TMS packaged solutions, with emphasis on designing, implementing, and supporting Supply Chain processes and solutions;","Significant experience with leading clients and project teams in Blue Yonder TMS testing, User Acceptance testing, training development and delivery;","Knowledge and experience working with multiple top to mid-tier TMS vendors and experience leading and delivering TMS projects with the vendors;","Demonstrated excellence in project management, leading direct and indirect reports in a matrixed and multi-echelon environments through the design and implementation of people, process and technology changes to the logistics and warehousing functions at our clients;","Proven capabilities to work with complex planning data and analytical tools (e.g O9, Blue Yonder, Kinaxis, Excel, PowerBI, Alteryx, etc.)","to identify overall supply chain and facility design opportunities, model alternative approaches, and lead business case development to support design decisions and investment requirements;","Demonstrates extensive abilities and\/or a proven record of success with managing the identification and addressing of client needs with a focus on design, process, and technology changes to supply chain organizations by:"],"Benefits":["The salary range for this position is: $99,000 - $232,000, plus individuals may be eligible for an annual discretionary bonus","For roles that are based in Maryland, this is the listed salary range for this position","PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation, personal and family sick leave, and more"],"Responsibilities":["You'll be a part of a team that helps organisations in transforming their supply chains into a strategic asset","You’ll work with our clients to develop a supply chain strategy, optimise their supply chain footprint and logistics, manage transportation and distribution, and develop an integrated business planning solutions","As a Manager, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution","Develop new skills outside of comfort zone","Act to resolve issues which prevent the team working effectively","Coach others, recognise their strengths, and encourage them to take ownership of their personal development","Analyse complex ideas or proposals and build a range of meaningful recommendations","Use multiple sources of information including broader stakeholder views to develop solutions and recommendations","Address sub-standard work or work that does not meet firm's\/client's expectations","Use data and insights to inform conclusions and support decision-making","Develop a point of view on key global trends, and how they impact clients","Manage a variety of viewpoints to build consensus and create positive outcomes for all parties","Simplify complex messages, highlighting and summarising key points","Uphold the firm's code of ethics and business conduct","Managerial-level leadership experience with recognized TMS, WCS and WES vendor systems; and,","Understanding of overall supply chain market best practices related to transportation, warehousing, and distribution trends and how the systems integrate in to various systems including ERP, TMS, and automation controls","Leading teams to generate a vision for supply chain strategy;","Establish direction and motivate internal and external team members, create an atmosphere of trust, leverage diverse views, coach staff, and encourage improvement and innovation;","Participating in client discussions and meetings, managing engagements including preparing concise, accurate documents, conducting analytics associated with planning processes and balancing project economics management with the occurrence of unanticipated issues;","Creating a positive environment by monitoring workloads of the team while meeting client expectations and respecting the work-life quality of team members; providing candid, meaningful feedback in a timely manner; and,","Keeping leadership informed of progress and issues"]},"job_onet_soc":"11307100","job_onet_job_zone":"4"},{"job_id":"1lmNikAzvDhuTn1WAAAAAA==","job_title":"Senior Director, Supply Chain Management","employer_name":"MedStar Health","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcQkzwUwAbYMO5Cbg7qQxm6D2xqvACtE9urZzx4Y&s=0","employer_website":"https:\/\/www.medstarhealth.org","job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/senior-director-supply-chain-management-at-medstar-health-4337958243?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/senior-director-supply-chain-management-at-medstar-health-4337958243?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/dd606beecaed1cbf77978e1fd9b087c9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Lensa","apply_link":"https:\/\/lensa.com\/job-v1\/western-digital\/washington-dc\/director-of-supply-chain\/8c14d1ee8f50c9dbc66825e6f04b54af?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobs Trabajo.org","apply_link":"https:\/\/us.trabajo.org\/job-2611-650d6c96fcf55ec6b6842711d4351cee?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/amp\/job\/us-dc-washington-senior-director-supply-chain-management-medstar-health?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Shape systemwide excellence in operations, standardization, and innovation at MedStar Health.\n\nWe are seeking a Senior Director, Supply Chain Management to provide operational and strategic oversight at MedStar Washington Hospital Center. This role will lead daily operations, inventory management, and budget accountability for all related functions. You will support systemwide integration and standardization of supplies and services by facilitating local Clinical Value Analysis Implementation Committees and managing vendor relationships while also partnering with the System AVP of Operations on specialized initiatives—focused on people, process, or technology—to ensure consistent design, implementation, and execution across the organization.\n\nMedStar Health is a great place to work and grow your career. We provide a supportive and inclusive work environment, comprehensive health and wellness benefits, generous PTO, tuition assistance, retirement plans, and many other benefits focused on your wellbeing.\n\nMinimum Qualifications\n• Bachelor's degree in business administration, supply chain management, or a similar field of study required.\n• Master's degree in business administration, supply chain management, or a similar field of study preferred\n• 5-7 years of progressively more responsible job-related experience as a manager or Director of Materials Management, preferably in a high-volume environment required.\n\nAbout MedStar Health\n\nMedStar Health is dedicated to providing the highest quality care for people in Maryland and the Washington, D.C., region, while advancing the practice of medicine through education, innovation, and research. Our team of 33,000 includes physicians, nurses, residents, fellows, and many other clinical and non-clinical associates working in a variety of settings across our health system, including 10 hospitals and more than 300 community-based locations, the largest home health provider in the region, and highly respected institutes dedicated to research and innovation. As the medical education and clinical partner of Georgetown University for more than 20 years, MedStar Health is dedicated not only to teaching the next generation of doctors, but also to the continuing education, professional development, and personal fulfillment of our whole team. Together, we use the best of our minds and the best of our hearts to serve our patients, those who care for them, and our communities. It’s how we treat people.","job_is_remote":false,"job_posted_at":"7 days ago","job_posted_at_timestamp":1762387200,"job_posted_at_datetime_utc":"2025-11-06T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":["paid_time_off","health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D1lmNikAzvDhuTn1WAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":114004,"job_max_salary":219960,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["Bachelor's degree in business administration, supply chain management, or a similar field of study required","5-7 years of progressively more responsible job-related experience as a manager or Director of Materials Management, preferably in a high-volume environment required"],"Benefits":["We provide a supportive and inclusive work environment, comprehensive health and wellness benefits, generous PTO, tuition assistance, retirement plans, and many other benefits focused on your wellbeing"],"Responsibilities":["This role will lead daily operations, inventory management, and budget accountability for all related functions","You will support systemwide integration and standardization of supplies and services by facilitating local Clinical Value Analysis Implementation Committees and managing vendor relationships while also partnering with the System AVP of Operations on specialized initiatives—focused on people, process, or technology—to ensure consistent design, implementation, and execution across the organization"]},"job_onet_soc":"11919900","job_onet_job_zone":"4"},{"job_id":"PDvdaOGlfejHexi3AAAAAA==","job_title":"Manager 3 Global Supply Chain - Small Business Compliance","employer_name":"Northrop Grumman Corporation","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcRnOto6va2gb-qi1aX2hNIui8hXG8-3Dv5rgLAZ&s=0","employer_website":"https:\/\/www.northropgrumman.com","job_publisher":"ZipRecruiter","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.ziprecruiter.com\/c\/Northrop-Grumman\/Job\/Manager-3-Global-Supply-Chain-Small-Business-Compliance\/-in-Washington,DC?jid=c7004326a9c19a98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":true,"apply_options":[{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Northrop-Grumman\/Job\/Manager-3-Global-Supply-Chain-Small-Business-Compliance\/-in-Washington,DC?jid=c7004326a9c19a98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"Ladders","apply_link":"https:\/\/www.theladders.com\/job\/digital-solutions-p2p-and-supply-chain-implementation-manager-connor-group-global-services-llc-washington-metro-dc_82960995?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JobLeads","apply_link":"https:\/\/www.jobleads.com\/us\/job\/manager-manufacturing-and-supply-chain--washington--e796c5c2e0bdec77904d49c9ccbb80486?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/operations-manager?id=2227576039&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"BeBee","apply_link":"https:\/\/us.bebee.com\/job\/2e39941c7e4881e2a6ec698e63f76ef4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobrapido","apply_link":"https:\/\/us.jobrapido.com\/jobpreview\/7725307804302442496?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobilize","apply_link":"https:\/\/www.jobilize.com\/job\/us-dc-washington-manager-manufacturing-supply-chain-mckinsey-company?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"RELOCATION ASSISTANCE: No relocation assistance available\n\nCLEARANCE TYPE: None\n\nTRAVEL: Yes, 10% of the Time\n\nDescription\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nNorthrop Grumman is seeking a seasoned professional and dynamic Senior Manager, Global Supply Chain to lead the Small Business Compliance Team. Reporting directly to the Director, Global Supply Chain Compliance, the Small Business Compliance Manager will be responsible for compliance with federal regulations regarding small business participation in government contracts and subcontracts. This role requires an understanding of regulatory requirements, strong leadership skills, and the ability to develop and execute processes that support Northrop Grumman's commitment to small business engagement.\n\nWhat You Will Do:\n• Lead and manage the enterprise Small Business Compliance Team to comply with the Federal Acquisition Regulation (FAR) and other customer requirements related to small business laws, regulations and company policies and procedures.\n• Assist with developing, implementing, and maintaining policies and procedures related to small business participation in government contracts and subcontracts.\n• Assist the sector SBLOs with monitoring changes in regulations and industry standards, ensuring that Northrop Grumman remains compliant and competitive.\n• Support compliance reviews from the U.S. Government, internal audit and other oversight agencies as required.\n• Represents organization as a Small Business Subject Matter Expert (SME).\n• Interacts with internal and external personnel on a variety of significant matters often requiring coordination with various business functions across the enterprise.\n• Serve as the point of contact for internal stakeholders on matters related to small business program compliance.\n• Analyze performance data, gather and develop solutions or alternative methods of proceeding to optimize performance.\n• Represent Northrop Grumman at industry events, conferences, and meetings related to small business.\n• Foster a culture of compliance, collaboration, and ethical professional behavior within the organization.\n• Work with cross functional teams to interpret small business requirements and identify small businesses to support program requirements.\n\nBasic Qualifications:\n• Bachelor's degree and 10+ years of relevant experience OR Master's degree and 8+ years of relevant experience\n• Minimum of 8 years of leadership experience in government, defense, or aerospace compliance\n• In-depth knowledge of federal regulations related to small business participation in government contracts and subcontracts, including FAR and DFARS\n• Experience leading and managing a team\n• Experience with project management and the ability to manage multiple priorities and meet deadlines\n• Experience working with small businesses in a government contracting and subcontracting environment\n• Flexibility to travel, up to 10% annually\n• Proficiency in the Microsoft Office Suite\n\nPreferred Qualifications:\n• Experience leading a small business audit\n• Familiarity with the requirements of the DoD Comprehensive Subcontracting Plan\n• Experience developing and implementing small business initiatives\n• Experience growing a small business program\n• SBIR\/STTR Knowledge\n• Knowledge and understanding of Mentor-Protege Programs\n• Experience providing proposal support\n• Experience leading and influencing without direct authority\n• Experience hosting virtual events\n\nPrimary Level Salary Range: $140,500.00 - $210,700.00\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nDepending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and\/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO and pay transparency statement, please visit http:\/\/www.northropgrumman.com\/EEO. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.","job_is_remote":false,"job_posted_at":"15 days ago","job_posted_at_timestamp":1761696000,"job_posted_at_datetime_utc":"2025-10-29T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":["paid_time_off","health_insurance","dental_coverage"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DPDvdaOGlfejHexi3AAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":140000,"job_max_salary":211000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["This role requires an understanding of regulatory requirements, strong leadership skills, and the ability to develop and execute processes that support Northrop Grumman's commitment to small business engagement","Bachelor's degree and 10+ years of relevant experience OR Master's degree and 8+ years of relevant experience","Minimum of 8 years of leadership experience in government, defense, or aerospace compliance","In-depth knowledge of federal regulations related to small business participation in government contracts and subcontracts, including FAR and DFARS","Experience leading and managing a team","Experience with project management and the ability to manage multiple priorities and meet deadlines","Experience working with small businesses in a government contracting and subcontracting environment","Flexibility to travel, up to 10% annually","Proficiency in the Microsoft Office Suite"],"Benefits":["Primary Level Salary Range: $140,500.00 - $210,700.00","The above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions","Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay","Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results","Employees in Vice President or Director positions may be eligible for Long Term Incentives","In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and\/or personal business"],"Responsibilities":["TRAVEL: Yes, 10% of the Time","Reporting directly to the Director, Global Supply Chain Compliance, the Small Business Compliance Manager will be responsible for compliance with federal regulations regarding small business participation in government contracts and subcontracts","Lead and manage the enterprise Small Business Compliance Team to comply with the Federal Acquisition Regulation (FAR) and other customer requirements related to small business laws, regulations and company policies and procedures","Assist with developing, implementing, and maintaining policies and procedures related to small business participation in government contracts and subcontracts","Assist the sector SBLOs with monitoring changes in regulations and industry standards, ensuring that Northrop Grumman remains compliant and competitive","Support compliance reviews from the U.S. Government, internal audit and other oversight agencies as required","Represents organization as a Small Business Subject Matter Expert (SME)","Interacts with internal and external personnel on a variety of significant matters often requiring coordination with various business functions across the enterprise","Serve as the point of contact for internal stakeholders on matters related to small business program compliance","Analyze performance data, gather and develop solutions or alternative methods of proceeding to optimize performance","Represent Northrop Grumman at industry events, conferences, and meetings related to small business","Foster a culture of compliance, collaboration, and ethical professional behavior within the organization","Work with cross functional teams to interpret small business requirements and identify small businesses to support program requirements"]},"job_onet_soc":"11919900","job_onet_job_zone":"4"},{"job_id":"wZneHOViW5aNXHwyAAAAAA==","job_title":"Supply Chain & Operations - Procurement Category Management & Sourcing Consulting - Senior Manager","employer_name":"EY","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcTlZ66B6ghniNTEFs4o7QLTG1RvcBKx1cs9hzyP&s=0","employer_website":null,"job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/supply-chain-operations-procurement-category-management-sourcing-consulting-senior-manager-at-ey-4339693873?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/supply-chain-operations-procurement-category-management-sourcing-consulting-senior-manager-at-ey-4339693873?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobs | EY","apply_link":"https:\/\/ey.jobs\/mclean-va\/supply-chain-operations-procurement-category-management-sourcing-consulting-senior-manager\/B6BBA632CD6845F387BF23FD59A931F2\/job\/?vs=25&utm_source=RR+RSS+Feed-DE&utm_medium=Other&utm_campaign=RR+RSS+Feed&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Ernst-&-Young\/Job\/Supply-Chain-&-Operations-Procurement-Category-Management-&-Sourcing-Consulting-Senior-Manager\/-in-Mclean,VA?jid=a055b725f4ed0e46&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/supply-chain?id=2257436183&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Learn4Good","apply_link":"https:\/\/www.learn4good.com\/jobs\/mclean\/virginia\/info_technology\/4520947089\/e\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Location: Akron, Atlanta, Boston, Charlotte, Chicago, Cleveland, Cincinnati, Dallas, Denver, Detroit, Houston, Hoboken, Irvine, Los Angeles, McLean, Miami, Nashville, New York, Philadelphia, Portland, Phoenix, Pittsburgh, San Diego, San Francisco, San Jose, Seattle, St. Louis.\n\nAt EY, we’re all in to shape your future with confidence.\n\nWe’ll help you succeed in a globally connected powerhouse of diverse teams and take your career wherever you want it to go. Join EY and help to build a better working world.\n\nSupply Chain & Operations – Procurement Category Management & Sourcing Consulting – Senior Manager\n\nThe opportunity\n\nWe are seeking a senior manager with deep expertise in Strategic Procurement, including Category Management and Sourcing capabilities. As a Category Management & Sourcing Consulting Senior Manager, you will lead complex programs in assessing client’s category management and source-to-contract capabilities, identifying opportunities to improve total value generation through all dimensions of category strategy and execution. You will lead a team of consultants to deliver value to our clients, improving their strategic procurement processes and delivering cost reduction, service improvement, and optimal sourcing strategies. As a leader in the procurement practice, this position offers the chance to work closely with clients, collaboratively finding innovative approaches including use of AI, to deliver that value.\n\nYour Key Responsibilities\n\nAs a senior manager in EY’s Procurement practice, you will:\n• Serve as a client-facing consultant, actively engaging with senior clients in assessing opportunities for strategic procurement improvement, and teaming with clients in delivering those improvements\n• Prepare for and lead process workshops with clients, guiding discussions to gather information, assess current state, and collaborating to identify opportunities for total cost reduction\n• Identify client challenges within their category management processes and recommend innovative solutions leveraging leading practices\n• Lead and shape pursuits, including proposal team leadership, proposal development, and sales support\n• Develop approaches for complex program delivery, lead and support overall program management of the engagement with high service quality\n• Ensure high quality engagement deliverables throughout the project lifecycle, driving development, facilitating client reviews, and ensuring alignment with client expectations\n• Design and implement AI-driven procurement solutions within strategic procurement to optimize decision-making and efficiency\n• Leverage deep category expertise across numerous spend categories in support of assessments, client pursuits, and delivery of client engagements\n• Lead teams conducting strategic sourcing and other total cost reduction efforts\n• Foster strong relationships with client program leaders, sponsors, and stakeholders to ensure successful project delivery and client satisfaction\n• Leverage deep understanding of sourcing and total cost reduction areas to coach and develop team members in assessing opportunity and delivering client value\n• Lead and support development of thought leadership on sourcing and category management topic areas including use of AI and agentic AI\n• Develop and apply expertise in strategic procurement technology solutions encompassing spend and contract analytics tools, sourcing \/ autonomous sourcing and negotiations tools, contract lifecycle management solutions\n• Support business development initiatives including new solution identification and development\n• Mentor and guide team members in best practices for delivery of complex assessment, sourcing and category management projects\n\nSkills And Attributes For Success\n• Ability to think holistically across people, process, data, and technology to assess opportunities and develop innovative solutions for clients\n• Analytical mindset with a focus on combining data and qualitative information to develop insights for improvement and problem-solving.\n• Ability to manage complex projects with multiple workstreams and priorities effectively, including collaboration with global EY and client teams\n• Deep understanding of category management and sourcing capabilities and best practices\n• Strong communication and storytelling skills with the ability to tailor insights for different business audiences\n• Client-facing experience in shaping or selling transformational procurement programs that include multiple workstreams across S2P process and technology areas\n• Entrepreneurial mindset with the ability to thrive in ambiguous, fast-moving client environments\n• Strong leadership and team collaboration skills\n• Excellent communication and stakeholder management skills\n\nTo qualify for the role, you must have\n• A bachelor’s degree in Supply Chain Management, Industrial Engineering, or a related field\n• 7-10 years of experience in strategic sourcing, category management, with at least 4 years of procurement consulting\n• Previous experience in a leadership role within a consulting environment\n• Strong understanding of procurement processes and best practices\n• Category experience in indirect or direct category management\n• Demonstrated experience in shaping and defining solutions that drive total cost reduction or capability improvement\n\nIdeally, you’ll also have\n• Master’s degree such as MBA\n• Experience with spend analytics, sourcing opportunity assessment, strategic sourcing methodologies and project management frameworks\n• Experience with Sourcing and Category Management Procurement technology and AI solutions\n• Consulting experience or involvement in multi-disciplinary transformation projects\n• Experience in applying change management approaches on improvement programs\n\nWhat We Look For\n\nWe seek proactive and innovative individuals who are passionate about transforming procurement processes through effective orchestration solutions. You should be a strategic thinker with the ability to collaborate across teams, inspire others, and drive successful outcomes for our clients.\n\nWhat We Offer You\n\nAt EY, we’ll develop you with future-focused skills and equip you with world-class experiences. We’ll empower you in a flexible environment, and fuel you and your extraordinary talents in a diverse and inclusive culture of globally connected teams. Learn more.\n• We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $150,400 to $343,600. The base salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $180,500 to $390,500. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options.\n• Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year.\n• Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter\/Summer breaks, Personal\/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\n\nAre you ready to shape your future with confidence? Apply today.\n\nEY accepts applications for this position on an on-going basis.\n\nFor those living in California, please click here for additional information.\n\nEY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities.\n\nEY | Building a better working world\n\nEY is building a better working world by creating new value for clients, people, society and the planet, while building trust in capital markets.\n\nEnabled by data, AI and advanced technology, EY teams help clients shape the future with confidence and develop answers for the most pressing issues of today and tomorrow.\n\nEY teams work across a full spectrum of services in assurance, consulting, tax, strategy and transactions. Fueled by sector insights, a globally connected, multi-disciplinary network and diverse ecosystem partners, EY teams can provide services in more than 150 countries and territories.\n\nEY provides equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity\/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. \n\nEY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ssc.customersupport@ey.com.","job_is_remote":false,"job_posted_at":"2 days ago","job_posted_at_timestamp":1762819200,"job_posted_at_datetime_utc":"2025-11-11T00:00:00.000Z","job_location":"McLean, VA","job_city":"McLean","job_state":"Virginia","job_country":"US","job_latitude":38.9338676,"job_longitude":-77.1772604,"job_benefits":["dental_coverage","health_insurance","paid_time_off"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DwZneHOViW5aNXHwyAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":150000,"job_max_salary":344000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["Ability to think holistically across people, process, data, and technology to assess opportunities and develop innovative solutions for clients","Analytical mindset with a focus on combining data and qualitative information to develop insights for improvement and problem-solving","Ability to manage complex projects with multiple workstreams and priorities effectively, including collaboration with global EY and client teams","Deep understanding of category management and sourcing capabilities and best practices","Strong communication and storytelling skills with the ability to tailor insights for different business audiences","Client-facing experience in shaping or selling transformational procurement programs that include multiple workstreams across S2P process and technology areas","Entrepreneurial mindset with the ability to thrive in ambiguous, fast-moving client environments","Strong leadership and team collaboration skills","Excellent communication and stakeholder management skills","A bachelor’s degree in Supply Chain Management, Industrial Engineering, or a related field","7-10 years of experience in strategic sourcing, category management, with at least 4 years of procurement consulting","Previous experience in a leadership role within a consulting environment","Strong understanding of procurement processes and best practices","Category experience in indirect or direct category management","Demonstrated experience in shaping and defining solutions that drive total cost reduction or capability improvement","Master’s degree such as MBA","Experience with spend analytics, sourcing opportunity assessment, strategic sourcing methodologies and project management frameworks","Experience with Sourcing and Category Management Procurement technology and AI solutions","Consulting experience or involvement in multi-disciplinary transformation projects","Experience in applying change management approaches on improvement programs","You should be a strategic thinker with the ability to collaborate across teams, inspire others, and drive successful outcomes for our clients"],"Benefits":["At EY, we’ll develop you with future-focused skills and equip you with world-class experiences","We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business","The base salary range for this job in all geographic locations in the US is $150,400 to $343,600","The base salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $180,500 to $390,500","Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography","In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options","Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances","You’ll also be granted time off for designated EY Paid Holidays, Winter\/Summer breaks, Personal\/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being"],"Responsibilities":["As a Category Management & Sourcing Consulting Senior Manager, you will lead complex programs in assessing client’s category management and source-to-contract capabilities, identifying opportunities to improve total value generation through all dimensions of category strategy and execution","You will lead a team of consultants to deliver value to our clients, improving their strategic procurement processes and delivering cost reduction, service improvement, and optimal sourcing strategies","As a leader in the procurement practice, this position offers the chance to work closely with clients, collaboratively finding innovative approaches including use of AI, to deliver that value","As a senior manager in EY’s Procurement practice, you will:","Serve as a client-facing consultant, actively engaging with senior clients in assessing opportunities for strategic procurement improvement, and teaming with clients in delivering those improvements","Prepare for and lead process workshops with clients, guiding discussions to gather information, assess current state, and collaborating to identify opportunities for total cost reduction","Identify client challenges within their category management processes and recommend innovative solutions leveraging leading practices","Lead and shape pursuits, including proposal team leadership, proposal development, and sales support","Develop approaches for complex program delivery, lead and support overall program management of the engagement with high service quality","Ensure high quality engagement deliverables throughout the project lifecycle, driving development, facilitating client reviews, and ensuring alignment with client expectations","Design and implement AI-driven procurement solutions within strategic procurement to optimize decision-making and efficiency","Leverage deep category expertise across numerous spend categories in support of assessments, client pursuits, and delivery of client engagements","Lead teams conducting strategic sourcing and other total cost reduction efforts","Foster strong relationships with client program leaders, sponsors, and stakeholders to ensure successful project delivery and client satisfaction","Leverage deep understanding of sourcing and total cost reduction areas to coach and develop team members in assessing opportunity and delivering client value","Lead and support development of thought leadership on sourcing and category management topic areas including use of AI and agentic AI","Develop and apply expertise in strategic procurement technology solutions encompassing spend and contract analytics tools, sourcing \/ autonomous sourcing and negotiations tools, contract lifecycle management solutions","Support business development initiatives including new solution identification and development","Mentor and guide team members in best practices for delivery of complex assessment, sourcing and category management projects"]},"job_onet_soc":"11306100","job_onet_job_zone":"4"},{"job_id":"h6ULqgqEMblei9cyAAAAAA==","job_title":"Supply Chain Manager","employer_name":"Sma","employer_logo":null,"employer_website":null,"job_publisher":"Teal","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.tealhq.com\/job\/supply-chain-manager_e63949c1-4ec4-4dd6-a725-745ed657af4b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Teal","apply_link":"https:\/\/www.tealhq.com\/job\/supply-chain-manager_e63949c1-4ec4-4dd6-a725-745ed657af4b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"JSfirm.com","apply_link":"https:\/\/wwe.jsfirm.com\/Management\/Supply+Chain+Manager\/Chandigarh-Chandigarh\/jobID_1587993?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobs Trabajo.org","apply_link":"https:\/\/us.trabajo.org\/job-3643-72c20d89e993ff37e0298aaeb0aae84a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Comournpeiserbutters.forum","apply_link":"http:\/\/comournpeiserbutters.forum\/profiles\/27D-k4Oj6b2CSa6W?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Ftapp.life","apply_link":"https:\/\/ftapp.life\/tutorials\/daniel%20cassany%20la%20cocina%20de%20la%20escritura%20epub%20files?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Careenersnoesisbatteryman.com","apply_link":"https:\/\/careenersnoesisbatteryman.com\/campaigns\/SW84opCwJIBX3QG_?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Meetwes.life","apply_link":"https:\/\/meetwes.life\/comments\/CqteCGzFeeo5SIEJ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Geteast.forum","apply_link":"https:\/\/geteast.forum\/friends\/xU_vCA9_7MZlckpZ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"About the position\n\nResponsibilities\n• Lead the Primary Surface Radar proposal effort.\n• Manage all traditional PM roles plus writers and SMEs.\n\nRequirements\n• Approximately up to 20 years of experience in supply chain management.\n• Ability to solve problems and work well in teams.\n• Enjoy challenges and have a proactive approach.","job_is_remote":false,"job_posted_at":null,"job_posted_at_timestamp":null,"job_posted_at_datetime_utc":null,"job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":null,"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3Dh6ULqgqEMblei9cyAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Approximately up to 20 years of experience in supply chain management","Ability to solve problems and work well in teams","Enjoy challenges and have a proactive approach"],"Responsibilities":["Lead the Primary Surface Radar proposal effort","Manage all traditional PM roles plus writers and SMEs"]},"job_onet_soc":"11919900","job_onet_job_zone":"4"},{"job_id":"6-rgvS4tIWUpU4jAAAAAAA==","job_title":"Supply Chain Manager II, Global Transportation Services, Strategic Planning","employer_name":"Amazon","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcTgGqkWMZJHkkGDUq-KhceATZFcQB8LkFPgXiKY&s=0","employer_website":"https:\/\/www.aboutamazon.com","job_publisher":"Ladders","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.theladders.com\/job\/supply-chain-manager-ii-global-transportation-services-strategic-planning-amazon-arlington-va_82265164?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Ladders","apply_link":"https:\/\/www.theladders.com\/job\/supply-chain-manager-ii-global-transportation-services-strategic-planning-amazon-arlington-va_82265164?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"LazyApply","apply_link":"https:\/\/lazyapply.com\/jobpreview\/supply-chain-manager-ii-global-transportation-services-strategic-planning-amazon-arlington-va_82265164?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Talents By Vaia","apply_link":"https:\/\/talents.vaia.com\/companies\/accenture\/supply-chain-and-operations-consulting-supply-chain-planning-senior-manager-telecom-industry-33652017\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Amazon Store","apply_link":"https:\/\/shop.testchamberhub.com\/blogs\/news\/supply-chain-manager-ii-global-transportation-services-strategic-planning?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Join Amazon's dynamic environment as a Senior Supply Chain Manager with a Network Capacity Background, where you will play a crucial role in shaping and optimizing various facets of our operations, concentrating on optimizing and managing the flow of goods, information, or services within the supply chain network. We have exciting opportunities across different business units, each seeking a skilled professional to lead strategic initiatives and drive process improvements, with a specific focus on network capacity and the physical flow of goods or services within the supply chain network. As a Senior Strategic Supply Chain Manager with a Network Capacity Background, you'll take end-to-end ownership of operations, emphasizing capacity planning, logistics optimization, network design, and analysis of operational efficiency.\n\nIn this role, you will collaborate with cross-functional teams, including Business, Operations, Supply Chain, Product, Finance, and more. Utilize your analytical prowess to identify opportunities for operational improvements, implement scalable systems, and drive automation to enhance efficiency, with a particular focus on optimizing the physical flow and operations within the supply chain network. Whether you're managing network capacity initiatives, overseeing cross-functional programs, or focusing on strategic projects, your impact will be visible, ongoing, and contribute directly to our commitment to being the most customer-centric company on earth.\n\nKey job responsibilities\n\n- Lead strategic initiatives related to network capacity within Amazon's various business units.\n\n- Concentrate on optimizing and managing the flow of goods, information, or services within the supply chain network.\n\n- Balance supply and demand, assess and improve the efficiency of distribution networks, warehouses, or logistics operations.\n\n- Analyze and synthesize data to identify opportunities for enhancing customer experiences and operational efficiency in network capacity.\n\n- Define metrics, develop program management mechanisms, and invent\/simplify processes to drive decision-making in complex network capacity situations.\n\n- Collaborate with stakeholders across different functions, influencing and facilitating agreements to achieve shared network capacity goals.\n\n- Manage cross-functional network capacity initiatives, ensuring continuous improvement and adherence to lean philosophy at scale.\n\n- Own a portfolio of cross-functional programs related to network capacity, driving performance improvement and efficiency in project delivery.\n\n- Identify and deliver operational improvement opportunities in network capacity, focusing on inventory management, logistics strategy, and transportation optimization.\n\n- Monitor and optimize key network capacity metrics to ensure the smooth flow of goods or services through the supply chain network.\n\nAbout the team\n\nThe GTS Strategic Planning team serves as the central steward for aligned strategic planning in U.S. Out Bound Transportation. Working in concert with diverse supply chain partners spanning first, middle, and last mile operations, as well as linehaul organizations, the team develops and enforces adherence to financial strategies. Their distinctive position enables them to provide senior leadership with a holistic understanding of how current and future performance will be affected by ongoing network transformations. This team's expertise in synthesizing complex data from various transportation segments allows for more accurate forecasting and strategic decision-making, ultimately driving operational efficiency and financial optimization across the entire out bound transportation network.\n\nBASIC QUALIFICATIONS\n\n- 3+ years of program or project management experience\n\n- 3+ years of working cross functionally with tech and non-tech teams experience\n\n- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\n\n- 2+ years of supply chain experience\n\n- Bachelor's degree in business, engineering, operations, supply chain, transportation logistics\n\n- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\n\n- Experience defining program requirements and using data and metrics to determine improvements\n\nPREFERRED QUALIFICATIONS\n\n- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\n\n- 3+ years of driving process improvements experience\n\n- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\n\n- Experience building processes, project management, and schedules\n\n- Master's degree in business, engineering, operations, supply chain, transportation logistics\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https:\/\/amazon.jobs\/content\/en\/how-we-hire\/accommodations for more information. If the country\/region you're applying in isn't listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $77,200\/year in our lowest geographic market up to $141,500\/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits. For more information, please visit https:\/\/www.aboutamazon.com\/workplace\/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.","job_is_remote":false,"job_posted_at":null,"job_posted_at_timestamp":null,"job_posted_at_datetime_utc":null,"job_location":"Arlington, VA","job_city":"Arlington","job_state":"Virginia","job_country":"US","job_latitude":38.8816208,"job_longitude":-77.09098089999999,"job_benefits":["health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D6-rgvS4tIWUpU4jAAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":77200,"job_max_salary":142000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["3+ years of program or project management experience","3+ years of working cross functionally with tech and non-tech teams experience","3+ years of defining and implementing process improvement initiatives using data and metrics experience","2+ years of supply chain experience","Bachelor's degree in business, engineering, operations, supply chain, transportation logistics","Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL","Experience defining program requirements and using data and metrics to determine improvements"],"Benefits":["The base pay for this position ranges from $77,200\/year in our lowest geographic market up to $141,500\/year in our highest geographic market","Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and\/or other benefits"],"Responsibilities":["As a Senior Strategic Supply Chain Manager with a Network Capacity Background, you'll take end-to-end ownership of operations, emphasizing capacity planning, logistics optimization, network design, and analysis of operational efficiency","In this role, you will collaborate with cross-functional teams, including Business, Operations, Supply Chain, Product, Finance, and more","Utilize your analytical prowess to identify opportunities for operational improvements, implement scalable systems, and drive automation to enhance efficiency, with a particular focus on optimizing the physical flow and operations within the supply chain network","Whether you're managing network capacity initiatives, overseeing cross-functional programs, or focusing on strategic projects, your impact will be visible, ongoing, and contribute directly to our commitment to being the most customer-centric company on earth","Lead strategic initiatives related to network capacity within Amazon's various business units","Concentrate on optimizing and managing the flow of goods, information, or services within the supply chain network","Balance supply and demand, assess and improve the efficiency of distribution networks, warehouses, or logistics operations","Analyze and synthesize data to identify opportunities for enhancing customer experiences and operational efficiency in network capacity","Define metrics, develop program management mechanisms, and invent\/simplify processes to drive decision-making in complex network capacity situations","Collaborate with stakeholders across different functions, influencing and facilitating agreements to achieve shared network capacity goals","Manage cross-functional network capacity initiatives, ensuring continuous improvement and adherence to lean philosophy at scale","Own a portfolio of cross-functional programs related to network capacity, driving performance improvement and efficiency in project delivery","Identify and deliver operational improvement opportunities in network capacity, focusing on inventory management, logistics strategy, and transportation optimization","Monitor and optimize key network capacity metrics to ensure the smooth flow of goods or services through the supply chain network","Working in concert with diverse supply chain partners spanning first, middle, and last mile operations, as well as linehaul organizations, the team develops and enforces adherence to financial strategies","Their distinctive position enables them to provide senior leadership with a holistic understanding of how current and future performance will be affected by ongoing network transformations","This team's expertise in synthesizing complex data from various transportation segments allows for more accurate forecasting and strategic decision-making, ultimately driving operational efficiency and financial optimization across the entire out bound transportation network"]},"job_onet_soc":"11307100","job_onet_job_zone":"4"},{"job_id":"QnbQnXTvUp9ikN7wAAAAAA==","job_title":"Oracle Cloud Supply Chain Manager","employer_name":"Virginia Staffing","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcRWea3O1wXP4d61BIy6jIKvatHQDwwKG3O7Hb_6&s=0","employer_website":"https:\/\/www.virginiastaffing.com","job_publisher":"Recruit.net","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.recruit.net\/job\/oracle-cloud-supply-chain-manager-jobs\/EB242BA52B4C8FFD?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"Recruit.net","apply_link":"https:\/\/www.recruit.net\/job\/oracle-cloud-supply-chain-manager-jobs\/EB242BA52B4C8FFD?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Oracle Cloud Supply Chain Manager\n\nToday's chief financial officers (CFOs) and financial executives are being asked to improve business performance and shareholder value, along with operational effectiveness and efficiency. Deloitte Oracle Cloud Supply Chain Managers help clients delineate strategy and vision, design and implement process and systems which align with business objectives and have a measurable impact on growth. Do you want to be a part of a team that transforms the business landscape for its clients? Do you want to be on the winning team that drives transformation, improves productivity, and streamlines business operations? Do you feel your skills surpass those of your peers and colleagues? If your answer is yes to all these questions, it's very nice to meet you and we want to hear from you immediately! Recruiting for this role ends on 12\/19\/2025.\n\nWork You'll Do\n• Responsible for driving the planning, design, and implementation aspects across the entire project workstreams.\n• Helps in package selection and analyzing the business value capture and the business case realization.\n• Works with the Program Steering Committee to manage timelines, risks, and issues across upstream and downstream systems\/teams for the entire Package program.\n• As a Diamond-level member of the Oracle Partner Network, Deloitte needs thought leaders like yourself to help pave the way for our clients and Oracle service line development.\n• Oracle Cloud SCM Managers reduce cost and support innovation at the enterprise level by managing business requirements and leading the functional design, prototyping and process design stages of Oracle Cloud implementations.\n\nResponsibilities will include:\n• Client Management: Manage day to day interactions with executive clients and sponsors.\n• Delivery: Manage and deliver components of client engagements that identify, design, and implement technology and creative business solutions for large companies. Responsibilities include, among others, managing teams in the identification of business requirements, functional design, process design (including scenario design, flow mapping), prototyping, testing, training, defining support procedures.\n• Business Development: Develop and maintain contact with top decision makers at key clients; organize and lead pursuit teams; participate and lead aspects of the proposal development process; contribute to the development of proposal pricing strategies.\n• People Development: Perform role of counselor and coach; provide input and guidance into the staffing process; actively participate in staff recruitment and retention activities; provide leadership and support for delivery teams and staff in local offices.\n\nThe Team\n\nOur Oracle offering drives business transformation services to improve performance and value delivered by the full suite of Oracle solutions. Got your head in the cloud? With so much technology moving to the Cloud, our business requirements are taking us to new heights. By harnessing the power of Oracle ERP Cloud, you can streamline enterprise business processes with ERP Cloud's Financials, Procurement, or Portfolio Management. Do you have the ability to transform an organization through the latest social, mobile, and analytic technologies? We're looking for someone that can increases the effectiveness of decision making and drive innovation. If your head is in the cloud, find out where we can take you with Oracle Enterprise Solutions. Learn more about our Oracle practice.\n\nQualifications Required:\n• Functional implementation experience on 4 or more complex, full lifecycle Oracle Cloud Supply Chain implementations.\n• 6+ years' total Oracle implementation experience.\n• Demonstrated experience as a senior resource assisting in the definition of systems strategy, gathering and documenting business requirements, leading fit-gap analysis, as-is and to-be business process designs, conference room pilots (CRPs) functional configuration, testing, client user training.\n• Ability to travel 50% on average, based on the work you do and the clients and industries\/sectors you serve.\n• Limited immigration sponsorship may be available.\n• A Bachelor's degree\n\nPreferred:\n• Full life-cycle implementation experience in any of the following: Oracle Supply Planning & Backlog Management, Oracle Cloud Order Management & GOP, Plan to Manufacture (PTM), Oracle Revenue Management Cloud Services (RMCS), or Oracle Field Service (OFS).\n• Ability to work independently and manage multiple task assignments.\n• Strong oral and written communication skills, including presentation skills (MS Visio, MS PowerPoint).\n• Strong problem solving and troubleshooting skills with the ability to exercise mature judgment.\n• An advanced degree in the area of specialization.\n• Experience leading an entire work stream of relevant Oracle applications.\n\nInformation for applicants with a need for accommodation: https:\/\/www2.deloitte.com\/us\/en\/pages\/careers\/articles\/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $130,800 - $241,000. You may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.","job_is_remote":false,"job_posted_at":"1 day ago","job_posted_at_timestamp":1762905600,"job_posted_at_datetime_utc":"2025-11-12T00:00:00.000Z","job_location":"Falls Church, VA","job_city":"Falls Church","job_state":"Virginia","job_country":"US","job_latitude":38.882334,"job_longitude":-77.1710914,"job_benefits":null,"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DQnbQnXTvUp9ikN7wAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Do you have the ability to transform an organization through the latest social, mobile, and analytic technologies?","We're looking for someone that can increases the effectiveness of decision making and drive innovation","Functional implementation experience on 4 or more complex, full lifecycle Oracle Cloud Supply Chain implementations","6+ years' total Oracle implementation experience","Demonstrated experience as a senior resource assisting in the definition of systems strategy, gathering and documenting business requirements, leading fit-gap analysis, as-is and to-be business process designs, conference room pilots (CRPs) functional configuration, testing, client user training","Ability to travel 50% on average, based on the work you do and the clients and industries\/sectors you serve","Limited immigration sponsorship may be available","A Bachelor's degree"],"Benefits":["The wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs","A reasonable estimate of the current range is $130,800 - $241,000","You may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance"],"Responsibilities":["Deloitte Oracle Cloud Supply Chain Managers help clients delineate strategy and vision, design and implement process and systems which align with business objectives and have a measurable impact on growth","Responsible for driving the planning, design, and implementation aspects across the entire project workstreams","Helps in package selection and analyzing the business value capture and the business case realization","Works with the Program Steering Committee to manage timelines, risks, and issues across upstream and downstream systems\/teams for the entire Package program","As a Diamond-level member of the Oracle Partner Network, Deloitte needs thought leaders like yourself to help pave the way for our clients and Oracle service line development","Oracle Cloud SCM Managers reduce cost and support innovation at the enterprise level by managing business requirements and leading the functional design, prototyping and process design stages of Oracle Cloud implementations","Client Management: Manage day to day interactions with executive clients and sponsors","Delivery: Manage and deliver components of client engagements that identify, design, and implement technology and creative business solutions for large companies","Responsibilities include, among others, managing teams in the identification of business requirements, functional design, process design (including scenario design, flow mapping), prototyping, testing, training, defining support procedures","Business Development: Develop and maintain contact with top decision makers at key clients; organize and lead pursuit teams; participate and lead aspects of the proposal development process; contribute to the development of proposal pricing strategies","People Development: Perform role of counselor and coach; provide input and guidance into the staffing process; actively participate in staff recruitment and retention activities; provide leadership and support for delivery teams and staff in local offices","By harnessing the power of Oracle ERP Cloud, you can streamline enterprise business processes with ERP Cloud's Financials, Procurement, or Portfolio Management"]},"job_onet_soc":"11919900","job_onet_job_zone":"4"},{"job_id":"sgikssGvBMdn1-MdAAAAAA==","job_title":"Remote Senior Purchasing Manager","employer_name":"WhatJobs Direct","employer_logo":null,"employer_website":"https:\/\/en-ng.whatjobs.com","job_publisher":"WhatJobs","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.whatjobs.com\/jobs\/supply-chain-manager?id=2253196952&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/supply-chain-manager?id=2253196952&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Our client is actively seeking a strategic and results-oriented Senior Purchasing Manager to join their remote team. This position is fully remote, providing an opportunity to manage procurement operations from any location. The ideal candidate will possess a Bachelor's degree in Supply Chain Management, Business Administration, or a related field, with a minimum of 7 years of experience in purchasing and procurement, ideally within (Specific industry, e.g., technology, manufacturing, consumer goods). You will be responsible for developing and implementing effective purchasing strategies, managing supplier relationships, negotiating contracts, and ensuring the timely and cost-effective acquisition of goods and services. Key responsibilities include identifying potential suppliers, evaluating their capabilities, and establishing strong, mutually beneficial partnerships. You will oversee the entire procurement process, from needs assessment and requisitioning to order placement, delivery, and payment. This role requires exceptional negotiation skills, a keen understanding of market trends, and the ability to analyze pricing and supply chain data. You will also be responsible for managing inventory levels, optimizing purchasing costs, and ensuring compliance with company policies and regulatory requirements. Strong leadership and communication skills are essential for collaborating with internal departments and external vendors. The ability to work independently, manage a complex workload, and drive continuous improvement in procurement processes is crucial. We are looking for a proactive individual with a strong ethical compass and a commitment to achieving optimal value for the organization. This is an excellent opportunity to lead purchasing initiatives in a dynamic and flexible remote environment.","job_is_remote":false,"job_posted_at":"4 days ago","job_posted_at_timestamp":1762646400,"job_posted_at_datetime_utc":"2025-11-09T00:00:00.000Z","job_location":"Washington, DC","job_city":"Washington","job_state":"District of Columbia","job_country":"US","job_latitude":38.9071923,"job_longitude":-77.0368707,"job_benefits":null,"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3DsgikssGvBMdn1-MdAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_salary":null,"job_min_salary":null,"job_max_salary":null,"job_salary_period":null,"job_highlights":{"Qualifications":["The ideal candidate will possess a Bachelor's degree in Supply Chain Management, Business Administration, or a related field, with a minimum of 7 years of experience in purchasing and procurement, ideally within (Specific industry, e.g., technology, manufacturing, consumer goods)","Strong leadership and communication skills are essential for collaborating with internal departments and external vendors","The ability to work independently, manage a complex workload, and drive continuous improvement in procurement processes is crucial","We are looking for a proactive individual with a strong ethical compass and a commitment to achieving optimal value for the organization","This is an excellent opportunity to lead purchasing initiatives in a dynamic and flexible remote environment"],"Responsibilities":["Our client is actively seeking a strategic and results-oriented Senior Purchasing Manager to join their remote team","This position is fully remote, providing an opportunity to manage procurement operations from any location","You will be responsible for developing and implementing effective purchasing strategies, managing supplier relationships, negotiating contracts, and ensuring the timely and cost-effective acquisition of goods and services","Key responsibilities include identifying potential suppliers, evaluating their capabilities, and establishing strong, mutually beneficial partnerships","You will oversee the entire procurement process, from needs assessment and requisitioning to order placement, delivery, and payment","This role requires exceptional negotiation skills, a keen understanding of market trends, and the ability to analyze pricing and supply chain data","You will also be responsible for managing inventory levels, optimizing purchasing costs, and ensuring compliance with company policies and regulatory requirements"]},"job_onet_soc":"11306100","job_onet_job_zone":"4"},{"job_id":"2acMJrSZCXLlZ73xAAAAAA==","job_title":"Supply Chain & Operations - Supply Chain Operations - Source-to-Pay Process - Senior","employer_name":"EY","employer_logo":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcTlZ66B6ghniNTEFs4o7QLTG1RvcBKx1cs9hzyP&s=0","employer_website":null,"job_publisher":"LinkedIn","job_employment_type":"Full-time","job_employment_types":["FULLTIME"],"job_apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/supply-chain-operations-supply-chain-operations-source-to-pay-process-senior-at-ey-4339970066?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","job_apply_is_direct":false,"apply_options":[{"publisher":"LinkedIn","apply_link":"https:\/\/www.linkedin.com\/jobs\/view\/supply-chain-operations-supply-chain-operations-source-to-pay-process-senior-at-ey-4339970066?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"Jobs | EY","apply_link":"https:\/\/ey.jobs\/891A01CFE68443BEA0FD04A4C47655F125?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"ZipRecruiter","apply_link":"https:\/\/www.ziprecruiter.com\/c\/Ernst-&-Young\/Job\/Supply-Chain-&-Operations-Supply-Chain-Operations-Source-to-Pay-Process-Senior\/-in-Mclean,VA?jid=067e1fd2dd05af9d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":true},{"publisher":"LocalJobs.com","apply_link":"https:\/\/www.localjobs.com\/job\/mclean-va-supply-chain-operations-supply-chain-operations-source-pay-process-senior?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false},{"publisher":"WhatJobs","apply_link":"https:\/\/www.whatjobs.com\/jobs\/sp?id=2256644766&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","is_direct":false}],"job_description":"Location: Akron, Atlanta, Boston, Charlotte, Chicago, Cleveland, Cincinnati, Dallas, Denver, Detroit, Houston, Hoboken, Irvine, Los Angeles, McLean, Miami, Nashville, New York, Philadelphia, Portland, Phoenix, Pittsburgh, San Diego, San Francisco, San Jose, Seattle, St. Louis.\n\nAt EY, we’re all in to shape your future with confidence.\n\nWe’ll help you succeed in a globally connected powerhouse of diverse teams and take your career wherever you want it to go. Join EY and help to build a better working world.\n\nSupply Chain Operations – Source-to-Pay Process - Senior\n\nThe opportunity\n\nWe are seeking a senior consultant with expertise in end-to-end Source-to-Pay (S2P) processes. As a S2P Process Senior Consultant, you will play a crucial role in optimizing and transforming S2P processes for our clients. With your expertise in end-to-end S2P processes and exposure to enabling technologies, you will provide strategic insights and support the delivery of innovative solutions that enhance S2P efficiency. This position offers the opportunity to work closely with clients, helping them navigate the complexities of S2P while leveraging the latest technologies to drive value.\n\nYour Key Responsibilities\n\nAs a senior consultant in EY’s Procurement practice, you will:\n• Serve as a client-facing consultant, actively engaging with clients to understand their needs and deliver tailored S2P solutions\n• Prepare for and lead process workshops with clients, guiding discussions to gather requirements and foster collaboration\n• Identify client challenges within their S2P processes and recommend innovative solutions that meet their business requirements and follow leading practices\n• Own deliverables throughout the project lifecycle, driving development, facilitating client reviews, and ensuring alignment with client expectations\n• Demonstrate strong organizational skills and attentiveness to delivery dates, ensuring timely completion of project milestones\n• Foster strong relationships with stakeholders to ensure successful project delivery and client satisfaction\n• Provide thought leadership on procurement strategies, process optimization, and technology trends.\n\nSkills And Attributes For Success\n• Proficiency in end-to-end S2P processes and procurement best practices\n• Ability to think holistically across people, process, data, and technology to design next-generation solutions\n• Analytical mindset with a focus on process improvement and problem-solving\n• Ability to manage multiple projects and priorities effectively\n• Excellent communication and stakeholder management abilities\n\nTo qualify for the role, you must have\n• A bachelor’s degree in Supply Chain, Information Technology, or a related field\n• 3-5 years of experience in business process design, procurement consulting or related roles with a focus on S2P\n• Strong understanding of procurement processes and best practices\n• Demonstrated experience in shaping and defining solutions for operational efficiency or digital enablement\n• Familiarity with leading procurement technologies and their application in S2P processes\n\nIdeally, you’ll also have\n• Previous Consulting experience or involvement in multi-disciplinary transformation projects\n• Exposure to advanced technologies such as AI and automation in procurement\n\nWhat We Look For\n\nWe seek motivated and knowledgeable individuals who are passionate about enhancing procurement processes through innovative solutions. You should be a strategic thinker with the ability to collaborate effectively with clients and teams, driving successful outcomes and delivering value.\n\nWhat We Offer You\n\nAt EY, we’ll develop you with future-focused skills and equip you with world-class experiences. We’ll empower you in a flexible environment, and fuel you and your extraordinary talents in a diverse and inclusive culture of globally connected teams. Learn more.\n• We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $97,300 to $178,300. The base salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $116,700 to $202,600. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options.\n• Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year.\n• Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter\/Summer breaks, Personal\/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\n\nAre you ready to shape your future with confidence? Apply today.\n\nEY accepts applications for this position on an on-going basis.\n\nFor those living in California, please click here for additional information.\n\nEY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities.\n\nEY | Building a better working world\n\nEY is building a better working world by creating new value for clients, people, society and the planet, while building trust in capital markets.\n\nEnabled by data, AI and advanced technology, EY teams help clients shape the future with confidence and develop answers for the most pressing issues of today and tomorrow.\n\nEY teams work across a full spectrum of services in assurance, consulting, tax, strategy and transactions. Fueled by sector insights, a globally connected, multi-disciplinary network and diverse ecosystem partners, EY teams can provide services in more than 150 countries and territories.\n\nEY provides equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity\/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. \n\nEY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ssc.customersupport@ey.com.","job_is_remote":false,"job_posted_at":"2 days ago","job_posted_at_timestamp":1762819200,"job_posted_at_datetime_utc":"2025-11-11T00:00:00.000Z","job_location":"McLean, VA","job_city":"McLean","job_state":"Virginia","job_country":"US","job_latitude":38.9338676,"job_longitude":-77.1772604,"job_benefits":["dental_coverage","paid_time_off","health_insurance"],"job_google_link":"https:\/\/www.google.com\/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20\/docid%3D2acMJrSZCXLlZ73xAAAAAA%3D%3D&vssid=jobs-detail-viewer","job_min_salary":97300,"job_max_salary":178000,"job_salary_period":"YEAR","job_highlights":{"Qualifications":["Proficiency in end-to-end S2P processes and procurement best practices","Ability to think holistically across people, process, data, and technology to design next-generation solutions","Analytical mindset with a focus on process improvement and problem-solving","Ability to manage multiple projects and priorities effectively","Excellent communication and stakeholder management abilities","A bachelor’s degree in Supply Chain, Information Technology, or a related field","3-5 years of experience in business process design, procurement consulting or related roles with a focus on S2P","Strong understanding of procurement processes and best practices","Demonstrated experience in shaping and defining solutions for operational efficiency or digital enablement","Familiarity with leading procurement technologies and their application in S2P processes","Previous Consulting experience or involvement in multi-disciplinary transformation projects","Exposure to advanced technologies such as AI and automation in procurement","We seek motivated and knowledgeable individuals who are passionate about enhancing procurement processes through innovative solutions","You should be a strategic thinker with the ability to collaborate effectively with clients and teams, driving successful outcomes and delivering value"],"Benefits":["At EY, we’ll develop you with future-focused skills and equip you with world-class experiences","We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business","The base salary range for this job in all geographic locations in the US is $97,300 to $178,300","The base salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $116,700 to $202,600","Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography","In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options","Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances","You’ll also be granted time off for designated EY Paid Holidays, Winter\/Summer breaks, Personal\/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being"],"Responsibilities":["As a S2P Process Senior Consultant, you will play a crucial role in optimizing and transforming S2P processes for our clients","With your expertise in end-to-end S2P processes and exposure to enabling technologies, you will provide strategic insights and support the delivery of innovative solutions that enhance S2P efficiency","This position offers the opportunity to work closely with clients, helping them navigate the complexities of S2P while leveraging the latest technologies to drive value","Serve as a client-facing consultant, actively engaging with clients to understand their needs and deliver tailored S2P solutions","Prepare for and lead process workshops with clients, guiding discussions to gather requirements and foster collaboration","Identify client challenges within their S2P processes and recommend innovative solutions that meet their business requirements and follow leading practices","Own deliverables throughout the project lifecycle, driving development, facilitating client reviews, and ensuring alignment with client expectations","Demonstrate strong organizational skills and attentiveness to delivery dates, ensuring timely completion of project milestones","Foster strong relationships with stakeholders to ensure successful project delivery and client satisfaction","Provide thought leadership on procurement strategies, process optimization, and technology trends"]},"job_onet_soc":"11306100","job_onet_job_zone":"4"}]}